[
  {
    "title": "Student journalists' role in telling story of UCSD encampment",
    "description": "College campuses have become a focal point for protests against the war in Gaza, and student journalists have been vital in telling the stories behind the protests. Plus, we get an update on recent KPBS reporting on the Imperial Valley.",
    "url": "https://www.kpbs.org/podcasts/kpbs-roundtable/student-journalists-role-in-telling-story-of-ucsd-encampment",
    "published_at": "2024-05-10T23:34:03Z"
  },
  {
    "title": "Billionaire Jim Simons’ Last Interview: The Hedge Fund Legend On The Universe, Making Money And Giving It Away",
    "description": "Simons, who died Friday at age 86, spoke at the Forbes 400 Summit on Philanthropy last September in his final public appearance.",
    "url": "https://www.forbes.com/sites/hanktucker/2024/05/10/billionaire-jim-simons-last-interview-the-hedge-fund-legend-on-the-universe-making-money-and-giving-it-away/",
    "published_at": "2024-05-10T22:27:40Z"
  },
  {
    "title": "Stocks Surge On Healthy Earnings Season, Rising Jobless Claims: This Week In The Markets",
    "description": "Week in markets: quiet week, Q1 earnings positive, S&P 500 and Dow Jones up, utilities sector stands out, job market and inflation concerns, interest rate cuts expected. Buffett reduces Apple stake, Apple unveils new iPads, Tesla cuts jobs in China, Pfizer se…",
    "url": "https://www.benzinga.com/news/earnings/earnings-beats/24/05/38770095/stocks-surge-on-healthy-earnings-season-rising-jobless-claims-this-week-in-the-marke",
    "published_at": "2024-05-10T22:09:06Z"
  },
  {
    "title": "Measuring The Private Jet Market In 2024",
    "description": "While business for private jets is down from the peak of 2022, the industry still has plenty of tailwinds, according to speakers at the International Aircraft Dealers Association Spring Conference, held earlier this week in La Jolla, California.",
    "url": "https://www.forbes.com/sites/douggollan/2024/05/10/measuring-the-private-jet-market-in-2024/",
    "published_at": "2024-05-10T20:46:28Z"
  },
  {
    "title": "The Man Who Brought Theoretical Physics to Wall Street",
    "description": "If hedge-fund titan (and elite mathematician) Jim Simons wasn’t history’s greatest trader, he was among a handful who could ever make that claim.",
    "url": "http://nymag.com/intelligencer/article/jim-simons-brought-theoretical-physics-to-wall-street.html",
    "published_at": "2024-05-10T20:35:13Z"
  },
  {
    "title": "Warren Buffett's Latest $2.6 Billion Buy Brings His Total Investment in This Stock to More Than $77 Billion in Under 6 Years",
    "description": "Last weekend, in the neighborhood of 40,000 investors flocked to Omaha for Berkshire Hathaway's (NYSE: BRK.A)(NYSE: BRK.B) annual shareholder meeting. The lure was simple: to hear the \"Oracle of Omaha,\" Warren Buffett, speak about stocks, the U.S. economy, an…",
    "url": "https://biztoc.com/x/82ead800beed4866",
    "published_at": "2024-05-10T18:32:07Z"
  },
  {
    "title": "Top ASX shares to buy for your superannuation fund in May 2024",
    "description": "Is your super working hard for you?\nThe post Top ASX shares to buy for your superannuation fund in May 2024 appeared first on The Motley Fool Australia.",
    "url": "https://www.fool.com.au/2024/05/11/top-asx-shares-to-buy-for-your-superannuation-fund-in-may-2024/",
    "published_at": "2024-05-10T18:00:00Z"
  },
  {
    "title": "Warren Buffett Says Berkshire Hathaway Sold All of Its Paramount Stock: 'We Lost Quite a Bit of Money'",
    "description": "As Paramount comes off a rocky week in which the company lost its CEO and its exclusive merger talks window with Skydance came to an end without a deal, Berkshire Hathaway CEO Warren Buffett says his company has now sold its entire stake in Paramount. Berkshi…",
    "url": "https://freerepublic.com/focus/f-chat/4236967/posts",
    "published_at": "2024-05-10T17:05:10Z"
  },
  {
    "title": "Bombshells From Warren Buffett Shock Investors: Why did he sell so much of his biggest holding - Apple?",
    "description": "If you haven’t tuned into the annual Berkshire Hathaway shareholder meeting to see highlights, a certain moment is grabbing headlines but another more nuanced one is where your attention should go.The most poignant moment of the day was when Warren turned to …",
    "url": "https://freerepublic.com/focus/f-chat/4236952/posts",
    "published_at": "2024-05-10T16:29:11Z"
  },
  {
    "title": "Jones Lang LaSalle Incorporated : Johns Manville signs new lease to keep world headquarters in Denver",
    "description": "(marketscreener.com) \n DENVER - May 8, 2024 - Johns Manville , a leading manufacturer of premium-quality building and specialty products and a Berkshire Hathaway company, announced today its world headquarters will stay in downtown Denver through at least 203…",
    "url": "https://www.marketscreener.com/quote/stock/JONES-LANG-LASALLE-INCORP-13180/news/Jones-Lang-LaSalle-Incorporated-Johns-Manville-signs-new-lease-to-keep-world-headquarters-in-Denve-46693274/",
    "published_at": "2024-05-10T16:03:08Z"
  },
  {
    "title": "The freshest business trends agents need to recognize in 2024",
    "description": "The business of selling real estate is evolving at an ever-escalating pace. If you can identify some of the emerging trends and begin to act on those trends, Jimmy Burgess writes, you'll separate yourself from your competition like never before.",
    "url": "https://www.inman.com/2024/05/10/the-freshest-business-trends-agents-need-to-recognize-in-2024/",
    "published_at": "2024-05-10T15:55:14Z"
  },
  {
    "title": "Wall Street Thinks This Warren Buffett AI Stock Pick Has 38% Upside",
    "description": "It’s no surprise that when Warren Buffett and Berkshire Hathaway Inc. (NYSE: BRK-A) part with shares of Apple Inc. (NASDAQ: AAPL), the largest stake in the Berkshire portfolio, it makes headlines. The so-called Oracle of Omaha is probably the best-known inves…",
    "url": "https://biztoc.com/x/13836972972797c9",
    "published_at": "2024-05-10T14:02:07Z"
  },
  {
    "title": "Global Meat and Poultry Processing Equipment Market 2024-2033: Increasing Demand for Ready-To-Eat (RTE) Foods Driving Market Growth",
    "description": "Dublin, May 10, 2024 (GLOBE NEWSWIRE) -- The \"Meat and Poultry Processing Equipment Global Market Report 2024\" report has been added to ResearchAndMarkets.com's offering.The global meat and poultry processing equipment market has grown strongly in recent year…",
    "url": "https://www.globenewswire.com/news-release/2024/05/10/2879646/28124/en/Global-Meat-and-Poultry-Processing-Equipment-Market-2024-2033-Increasing-Demand-for-Ready-To-Eat-RTE-Foods-Driving-Market-Growth.html",
    "published_at": "2024-05-10T13:05:00Z"
  },
  {
    "title": "Warren Buffett had to work from his iPhone for days after lines went down at Berkshire Hathaway",
    "description": "None Warren Buffett slashed his Apple stake then found himself forced to work from his iPhone. • None The investor turned to the device after phone lines went down this week at Berkshire Hathaway HQ. • None \"I'm glad we didn't sell all of our Apple,\" Buffett …",
    "url": "https://biztoc.com/x/a5e52db66ec4cd9a",
    "published_at": "2024-05-10T12:38:07Z"
  },
  {
    "title": "Berkshire Hathaway Profits Dropped 64%, but 5 Warren Buffett Dividend Stocks Ruled Q1",
    "description": "If any investor has stood the test of time, it is Warren Buffett, and with good reason. For years, the “Oracle of Omaha” has had a rock-star-like presence in the investing world, and his annual Berkshire Hathaway shareholders meeting last weekend drew thousan…",
    "url": "https://biztoc.com/x/5db424ef0a242dbf",
    "published_at": "2024-05-10T12:10:06Z"
  },
  {
    "title": "Warren Buffett had to work from his iPhone for days after lines went down at Berkshire Hathaway",
    "description": "Warren Buffett. Getty Images / Bill Pugliano Warren Buffett slashed his Apple stake then found himself forced to work from his iPhone. The investor turned to the device after phone lines went down this week at Berkshire Hathaway HQ. \"I'm glad we didn't sell a…",
    "url": "https://biztoc.com/x/038fbcd22b0d997d",
    "published_at": "2024-05-10T11:30:05Z"
  },
  {
    "title": "Warren Buffett had to work from his iPhone for days after lines went down at Berkshire Hathaway",
    "description": "Two days after disclosing his Apple stock sales, Warren Buffett found himself relying on his iPhone during an outage at Berkshire Hathaway's offices.",
    "url": "https://www.businessinsider.com/warren-buffett-apple-stock-sales-iphone-berkshire-phones-outage-tech-2024-5",
    "published_at": "2024-05-10T11:21:23Z"
  },
  {
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "published_at": "1970-01-01T00:00:00Z"
  },
  {
    "title": "Warren Buffett’s most recent purchase of $2.6 billion increases his total investment in this stock to over $77 billion in less than six years",
    "description": "With a winning track record that dates back more than a half-century it's not a surprise that professional & everyday investors wait on pins & needles to see what the \"Oracle of Omaha\" has been buying & selling",
    "url": "https://en.protothema.gr/warren-buffetts-most-recent-purchase-of-2-6-billion-increases-his-total-investment-in-this-stock-to-over-77-billion-in-less-than-six-years/",
    "published_at": "2024-05-10T11:12:00Z"
  },
  {
    "title": "‘It’s an obvious move’: Elon Musk says Warren Buffett should buy Tesla stock",
    "description": "Warren Buffett is one of the most closely watched investors in the world — and with good reason. From 1964 to 2023, he steered Berkshire Hathaway (BRK.B) to an astounding overall gain of 4,384,748%. Following Berkshire's recent annual shareholders meeting, th…",
    "url": "https://biztoc.com/x/3ca3cbc913a9a951",
    "published_at": "2024-05-10T11:00:12Z"
  },
  {
    "title": "A good monsoon, continuity of political setup and capex boom to keep us in good shape for next 12 months: Raamdeo Agrawal",
    "description": "Raamdeo Agrawal predicts BJP's Lok Sabha success, NDA gains, and current government continuity. Foreign investors sell billion daily due to election risk, causing market turbulence. Market bets on continuity for corporate earnings.",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/a-good-monsoon-continuity-of-political-setup-and-capex-boom-to-keep-us-in-good-shape-for-next-12-months-raamdeo-agrawal/articleshow/110010300.cms",
    "published_at": "2024-05-10T10:53:52Z"
  },
  {
    "title": "Elon Musk says Warren Buffett should buy Tesla stock — Berkshire already even owns a stake in its top competitor",
    "description": "Be greedy when others are fearful?",
    "url": "https://finance.yahoo.com/news/elon-musk-says-warren-buffett-105000375.html",
    "published_at": "2024-05-10T10:50:00Z"
  },
  {
    "title": "‘It’s an obvious move’: Elon Musk says Warren Buffett should buy Tesla stock — Berkshire already even owns a stake in its top competitor",
    "description": "Be greedy when others are fearful?",
    "url": "https://www.aol.com/finance/obvious-move-elon-musk-says-105000520.html",
    "published_at": "2024-05-10T10:50:00Z"
  },
  {
    "title": "100 Years of IBM",
    "description": "Tikalon LLC, Scientific Consulting and Intellectual Property Creation.  Includes links to interesting scientific, mathematics, computer and technical web sites.",
    "url": "http://www.tikalon.com/blog/blog.php?article=2024/IBM_100",
    "published_at": "2024-05-10T10:25:24Z"
  },
  {
    "title": "Warren Buffett's Latest $2.6 Billion Buy Brings His Total Investment in This Stock to More Than $77 Billion in Under 6 Years",
    "description": "Last weekend, in the neighborhood of 40,000 investors flocked to Omaha for Berkshire Hathaway's (NYSE: BRK.A)(NYSE: BRK.B) annual shareholder meeting. The lure was simple: to hear the \"Oracle of Omaha,\" Warren Buffett, speak about stocks, the U.S. economy, an…",
    "url": "https://biztoc.com/x/a0d20b61bfa085c4",
    "published_at": "2024-05-10T09:32:06Z"
  },
  {
    "title": "Markkinaviikko | Nokian potku-uhka, Olkiluodon huoltoviive ja Nesteen johtaja­ruletti – HS kertaa viikon tärkeimmät talous­uutiset",
    "description": "HS:n markkinaviikko kertaa yhdessä jutussa viikon tärkeimmät talous­uutiset.",
    "url": "https://www.hs.fi/talous/art-2000010411077.html",
    "published_at": "2024-05-10T09:00:00Z"
  },
  {
    "title": "Eventos extremos preocupam setor",
    "description": "Comercializadoras, geradoras, transmissoras e distribuidoras tentam entender o “novo anormal” do clima para aumentar a resiliência e mitigar impactos causados por ondas de calor, secas e tempestades",
    "url": "https://valor.globo.com/publicacoes/especiais/revista-energia/noticia/2024/05/10/eventos-extremos-preocupam-setor.ghtml",
    "published_at": "2024-05-10T08:11:30Z"
  },
  {
    "title": "Así es el plan de sucesión del Oráculo de Omaha",
    "description": "A sus 93 años, Warren Buffett, el presidente de Berkshire Hathaway, no tiene pensado retirarse, aunque es consciente de que debe pasar el relevo a Greg Abel, que también recibirá potestad para decidir sobre las inversiones del holding.",
    "url": "https://www.df.cl/senal-df/senales-financieras/asi-es-el-plan-de-sucesion-de-warren-buffett",
    "published_at": "2024-05-10T08:00:00Z"
  },
  {
    "title": "Co z Berkshire Hathaway po śmierci Warrena Buffetta? Wyrocznia z Omaha po raz pierwszy udzieliła dokładnej odpowiedzi",
    "description": "W USA odbyło się doroczne zgromadzenie \nakcjonariuszy Berkshire Hathaway. Warren Buffet pierwszy raz udzielił \ndokładnej odpowiedzi na pytanie o zarządzanie spółką po jego śmierci. \nTen temat oraz kwestię wyboru zawodu po maturze szczególnie poleca \nsłuchaczo…",
    "url": "https://www.bankier.pl/wiadomosc/Co-z-Berkshire-Hathaway-po-smierci-Warrena-Buffetta-Wyrocznia-z-Omaha-po-raz-pierwszy-udzielila-dokladnej-odpowiedzi-8743436.html",
    "published_at": "2024-05-10T07:53:51Z"
  },
  {
    "title": "2024 Berkshire Hathaway Annual Shareholder Meeting Video, Transcript, and Notes",
    "description": "The 2024 Berkshire Hathaway Annual Shareholder Meeting occurred on May 4th, 2024, and while there are lots of articles offering highlights (including this one), it’s never the same feeling as tuning into the actual thing. I always find a few nuggets that mean…",
    "url": "https://www.mymoneyblog.com/2024-berkshire-hathaway-annual-shareholder-meeting-video-transcript-and-notes.html",
    "published_at": "2024-05-10T07:18:06Z"
  },
  {
    "title": "Donazioni e imposta di successione, il fisco italiano è il più generoso d’Europa: le esenzioni e la riforma",
    "description": "Il gettito dell’imposta è piuttosto modesto (1.043 milioni nel 2022) e significativamente inferiore a quello dei principali Paesi europei. Non si paga nessuna imposta se la somma trasferita è inferiore a 1 milione di euroIl gettito dell’imposta è piuttosto mo…",
    "url": "https://www.corriere.it/economia/tasse/24_maggio_10/imposta-di-successione-e-donazioni-il-fisco-italiano-e-il-piu-generoso-d-europa-le-esenzioni-e-la-riforma-d5a3ca28-5c31-4c22-bb12-524875f37xlk.shtml",
    "published_at": "2024-05-10T06:10:10Z"
  },
  {
    "title": "Column-Forget market angst, just 'KISS' and make up: Mike Dolan",
    "description": "Column-Forget market angst, just 'KISS' and make up: Mike Dolan",
    "url": "https://www.investing.com/news/economy/columnforget-market-angst-just-kiss-and-make-up-mike-dolan-3433580",
    "published_at": "2024-05-10T06:05:55Z"
  },
  {
    "title": "Forget market angst, just 'KISS' and make up: Mike Dolan",
    "description": "(marketscreener.com) Worried about a hawkish Fed,\nover-valued stocks, teetering debt piles, volatile currencies,\ncliffhanger elections or rancorous geopolitics? Relax and don't\nover-think it.\n For those with long-term savings horizons, the temptation to\novert…",
    "url": "https://www.marketscreener.com/quote/stock/BERKSHIRE-HATHAWAY-INC-11915/news/Forget-market-angst-just-KISS-and-make-up-Mike-Dolan-46686708/",
    "published_at": "2024-05-10T06:00:00Z"
  },
  {
    "title": "India's near 8% GDP growth isn't transforming into stock market returns. Here's why",
    "description": "This year has also been particularly unlucky for Indian stock market investors thanks to the uncertainty added by politics.",
    "url": "https://www.cnbc.com/2024/05/10/cnbcs-inside-india-newsletter-a-disconnected-stock-market.html",
    "published_at": "2024-05-10T05:13:00Z"
  },
  {
    "title": "Buffett przejechał się na rozrywce. Wtopił na spółce od Wilka z Wall Street i Mody na Sukces",
    "description": "„Straciliśmy sporo pieniędzy. To się zdarza w tym biznesie” – powiedział miliarder Warren Buffett na dorocznym majowym spotkaniu akcjonariuszy Berkshire Hathaway. Chodziło mu o inwestycję w giganta rozrywki, jakim jest Paramount Global. Buffetta w spółce już …",
    "url": "https://www.bankier.pl/wiadomosc/Warren-Buffett-przejechal-sie-na-rozrywce-Wtopil-na-spolce-od-Wilka-z-Wall-Street-i-Mody-na-Sukces-ktora-chce-kupic-Sony-8742866.html",
    "published_at": "2024-05-10T04:08:10Z"
  }
]