[
  {
    "title": "Student journalists' role in telling story of UCSD encampment",
    "description": "College campuses have become a focal point for protests against the war in Gaza, and student journalists have been vital in telling the stories behind the protests. Plus, we get an update on recent KPBS reporting on the Imperial Valley.",
    "published_at": "2024-05-10T23:34:03Z",
    "content": null
  },
  {
    "title": "Billionaire Jim Simons’ Last Interview: The Hedge Fund Legend On The Universe, Making Money And Giving It Away",
    "description": "Simons, who died Friday at age 86, spoke at the Forbes 400 Summit on Philanthropy last September in his final public appearance.",
    "published_at": "2024-05-10T22:27:40Z",
    "content": "Hedge fund manager Jim Simons was the first and most successful to turn investing into a science using quantitative computer models. Jim Simons, a math professor turned hedge fund founder who pioneered investing with automated quantitative models and used his riches to become one of America’s leading philanthropists, died Friday at age 86 at his home in Manhattan, his foundation announced. Simons was a mathematical genius who chaired the math department at Stony Brook University, but he left that career to try his hand at the markets in 1978, when he was 40. He founded hedge fund Renaissance Technologies in 1982 and created its Medallion Fund in 1988, famed for beating the broader market and any investor who tried to compete with it—and also for closely guarding the secrets for how it did so. Renaissance is based in East Setauket, New York, 70 miles east of the city near the shore of the Long Island Sound. It has long valued its distance from prototypical Wall Street traders, instead hiring some of the world’s brightest mathematical minds. Its spartan website notes that 90 of its 300 employees have PhDs in math, physics, computer science or related fields. Renaissance now manages about $50 billion in assets, and its Medallion Fund for decades has only been open to Simons and the firm’s employees. The Medallion Fund charges a 4% management fee and performance fees ranging from 36% to 44%, much higher than any other major hedge fund, but it’s been more than worth it. After fees, the fund has still generated an annualized net return of more than 30% since inception. Warren Buffett’s Berkshire Hathaway has mustered a mere 20% compounded annual gain in comparison. That track record made Simons the 51st richest person in the world at the time of his death, with an estimated $31.4 billion fortune. He first appeared on the Forbes 400 list of richest Americans in 2004 with a net worth of $2.5 billion. Simons was intensely private, and the specifics of the investing strategy that fueled his success remain mostly a mystery. He made his last public appearance in September 2023 at the 11th Annual Forbes 400 Summit on Philanthropy in New York. He and his wife Marilyn Simons were presented with the Forbes 400 Lifetime Achievement Award for Philanthropy and spoke about their charitable work with Forbes Editor-at-Large Maneet Ahuja. Jim credited Marilyn with being the initial driving force behind the Simons Foundation, which they founded in 1994. “I just made the money and Marilyn gave it away,” he quipped on stage. That was likely true when they first began making charitable gifts. But in his later years Simons committed himself more personally to their charity. He stepped back from leading Renaissance in 2010, and he and Marilyn have given more than $6 billion away via their foundation, making them the sixth-most philanthropic givers in America, according to Forbes. The Simons Foundation, which had $4.9 billion in assets as of its most recently available tax filing, primarily supports education and math and science research. “The whole economy is more and more dependent on quantitative skills, and we’re behind in teaching them,” Simons told Forbes in 2016. Last year, the Simons pledged $500 million over seven years to Stony Brook University in the second-largest donation ever to a public college. Simons became the chair of the math department there at age 30 after stints teaching at Harvard and MIT and became renowned for his work on topology and understanding the features of complex geometric shapes. In 1976, he won the ​​American Mathematical Society's Oswald Veblen Prize, the highest honor in the field of geometry. “Stony Brook means a lot to us,” Simons said at last year’s Forbes Philanthropy Summit. “The department was only so-so, but [Nelson] Rockefeller was governor and he loved the state universities, so I had all the money I needed to build up the math department, which I did.” The school is also where he met Marilyn while she was a PhD student there, and last year he also recounted the humorous, if antiquated, story of how they were introduced. “My ex-wife was going to Europe for the summer, so I had to take care of our three children, so the university sent someone over to see if she would do that job,” he said. “We talked and we talked and we talked, and finally I said, ‘Do you have a boyfriend?’ And she said no, and the rest is history.” The couple has continued to invest heavily in math education, and in 2004, they founded Math for America, which provides stipends for 1,000 STEM teachers every year in New York City and has distributed more than $300 million over two decades. The foundation has given millions more to the National Museum of Mathematics, known as MoMath, in New York. In a 2017 interview with Forbes, Simons explained why helping math teachers was important to him. “If you know enough math today to teach in high school, then you probably know enough to work for Google or Goldman Sachs or Renaissance Technologies,” he said. “They pay a whole lot more than high school teaching. So, that means that not so many people who know the subject are going to go into that field, the field of teaching.” The Simons Foundation has also distributed hundreds of millions of dollars to support cancer and autism research at institutions like the Cold Spring Harbor Laboratory. “We have a team of people at the foundation which spends $100 million a year working on autism and understanding it better,” Simons said last September. “It’s not the only thing the foundation does of course, but it’s one of the important things that it does.” One of the foundation’s most recent initiatives was $90 million in contributions to the Simons Observatory in Chile, where the finishing touches are being put on advanced telescopes at an elevation of 17,000 feet near the summit of Cerro Toco, a volcanic mountain in the Atacama Desert. The telescopes are expected to be able to view the so-called cosmic microwave background, mapping all the radiation dating back to the Big Bang, with more detail than ever before. Simons’ intelligence and wistful curiosity shined through as he wrapped up his interview with Forbes last year, discussing the project. “The conventional thinking is that the universe started with a point, with one point, and then hugely expanded, which is called inflation. If that’s true, that big expansion would cause gravitational waves. The first thing we’re going to do with this telescope is see, are there really primordial gravitational waves right at the beginning?” Simons said. “Personally, I kind of hope we don’t find these gravitational waves because I don’t believe the universe started with a point. I think the universe has gone on way before anything. But we’ll see.” "
  },
  {
    "title": "Stocks Surge On Healthy Earnings Season, Rising Jobless Claims: This Week In The Markets",
    "description": "Week in markets: quiet week, Q1 earnings positive, S&P 500 and Dow Jones up, utilities sector stands out, job market and inflation concerns, interest rate cuts expected. Buffett reduces Apple stake, Apple unveils new iPads, Tesla cuts jobs in China, Pfizer se…",
    "published_at": "2024-05-10T22:09:06Z",
    "content": "It's been a quiet week in the markets, marked by a dearth of major economic news and a consistent flow of positive indicators from the first-quarter earnings season. As of May 7, 424 companies in the S&P 500 have disclosed their earnings, with 78% surpassing earnings expectations and 61% exceeding revenue forecasts. The S&P 500 continued its upward trend, marking its third consecutive week of gains and nearly recouping losses from April, while the Dow Jones boasted eight consecutive sessions in the green. Notably, the utilities sector, as tracked by the Utilities Select Sector SPDR Fund XLU, has emerged as the star performer of 2024, outstripping energy and doubling the tech sector’s performance, with some analysts attributing the outperformance to heightened power demand from data centers. Concerns surfaced regarding a potential job market slowdown following unexpectedly high weekly jobless claims. The figure reached its highest level in eight months. The University of Michigan's Consumer Sentiment report revealed a sharper-than-expected dip in May, along with a worrying rise in inflation expectations. Investors are now fully factoring in two interest rate cuts by year-end, beginning in September. Attention now turns to the forthcoming April Consumer Price Index inflation report on Wednesday and Federal Reserve Chair Jerome Powell‘s remarks in Amsterdam on Tuesday. Buffett Sells Apple Shares Warren Buffett‘s Berkshire Hathaway Inc. BRK has cut its stake in Apple Inc. AAPL by 18%, signaling waning confidence as the tech giant faces challenges in its Chinese market. Apple’s M4 iPads Meanwhile, Apple unveiled an iPad Pro with a M4 chip and OLED display, and an iPad Air with a M2 chip, enhancing the iPad lineup for the first time since 2022. The iPad Pro starts at $999 for the 11-inch model and $1,299 for the 13-inch model — higher price points than older releases. Tesla Cuts Jobs Tesla Inc. TSLA has initiated another round of job cuts in China due to intensifying competition in the electric vehicle market, which is increasingly dominated by local rivals. Pfizer Settles Lawsuits Pfizer Inc. PFE has agreed to settle over 10,000 lawsuits related to cancer risks associated with its discontinued heartburn medication Zantac. Nvidia Leads AI Nvidia Corp. NVDA has been declared the de facto standard in AI technology by a Goldman Sachs analyst, who said the company will dominate the sector for the foreseeable future. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about."
  },
  {
    "title": "Measuring The Private Jet Market In 2024",
    "description": "While business for private jets is down from the peak of 2022, the industry still has plenty of tailwinds, according to speakers at the International Aircraft Dealers Association Spring Conference, held earlier this week in La Jolla, California.",
    "published_at": "2024-05-10T20:46:28Z",
    "content": "Last night, I returned home to Miami after spending a bit longer than I had anticipated in San Diego, where I had been attending the Spring meeting of the International Aircraft Dealers Association, also known as IADA. In fact, I wasn’t supposed to be at home today. I was supposed to be visiting my father, who lives in what the airlines call a spoke city. In other words, to get there, you must change flights at one of their hubs. Thanks to American Airlines, it didn't work out that way, which is as good a segue as any into why private aviation is likely to be more relevant than ever for those who can afford it, emphasis on afford. So how is business in the world of private jets? After the pandemic led demand spike, is the industry headed up, down, or somewhere in between? Managing Director of AeroDynamic Advisory Richard Aboulafia, who has been tracking aviation for more than 30 years, calls it \"one of the more confusing market cycles I've seen.\" The IADA dealers, who operate like real estate agents for consumers and corporations who want to buy private aircraft, particularly preowned ones, are naturally optimistic. The group's members, who represent about 50% of preowned transactions globally, saw a 5.9% year-over-year increase in sales, with 253 closings in the first quarter of 2024. Like their brethren in the property market, brokers need something to sell, something that was lacking as inventory hit record lows during 2022. Rollie Vincent of Rolland Vincent Associates, an industry analyst and former manufacturer and fractional executive, said while inventories are still well below their 10-year averages, they have rebounded from substantially from those low points (image below). Available business aircraft inventory is below historic averages but up from the record lows of ... [+] 2022, according to analyst Rolland Vincent & Associates. Back then, buyers eschewed standards such as pre-buy inspections, which were more difficult due to pandemic restrictions, and simply wired millions of dollars to buy used private jets based on pictures. Many deals were made before aircraft were even listed. As I wrote last year, even as the bloom was off the rose, aircraft owners saw the benefits in being discreet, concerned their pilots would leave before they could sell their jets. Today, the outlook is bifurcated. Vincent surveys over 500 flight departments and users quarterly. His research shows a diminished, slightly negative sentiment over the past eight quarters from North American respondents who represent the industry's largest market of buyers. Supply, not demand, is holding back business aviation, according to analyst Richard Aboulafia ... [+] speaking during the International Aircraft Dealers Association Spring Conference, held earlier this week in La Jolla, California. Vincent told the audience that their outlook coincides with lower U.S. consumer and business confidence and a shift in the Federal Reserve's approach to interest rates, \"that money should cost money.\" At the same time, Aboulafia's research paints a different picture. He says the industry is constrained not by demand but by supply. He says manufacturers are still struggling to work their way through backlogs, perhaps prudently eschewing the huge investments it would take to ramp up production versus the memories of getting too far over their skies leading up to the 2008 financial crisis. \"For the first time, supply is the problem, not demand,\" he told attendees. Aboulafia said corporate profits and the strength in equities markets are reasons to be bullish about buyers. Ron Draper, President and CEO of Textron Aviation, told attendees of IADA's Spring Conference, ... [+] despite improvements, OEMs are still dealing with \"acute\" supply chain issues as they work through order books. Ruben Kempeneer, President of Aviation International News, a trade publisher, said corporate flight departments are increasingly looking to fractional shares, jet cards, and charter flights, not to replace owning jets, but as additional solutions. Flight trackers who circumvent privacy measures have companies concerned that missions to scout out or negotiate M&A deals could be seen by competitors. While Argus TraqPak data shows North American private flights in 2023 were down 3.7% from the 2022 peak, last year still ranked as the industry's second busiest year and was 17.5% ahead of 2019's pre-Covid numbers. For those looking to read the tea leaves, perhaps it’s worth tracking deliveries of new private jets to NetJets. By far the biggest buyer and operator of private aircraft, the unit of Berkshire Hathaway has signed options deals for up to almost 2,000 private jets it could buy over the next 15 years. Since 2010, annual worldwide deliveries of new jets have ranged from 672 (in 2012) to 809 (in 2019), so what NetJets ends up converting to firm orders is a big piece of the market. Keynote speaker Ron Draper, CEO of Textron Aviation, which has an agreement that could see it sell 1,500 of its jets to NetJets, told the dealers, \"When they're selling, we're selling.\" WingX, which tracks flight hours across the different aviation segments, including airlines and cargo, recently noted that NetJets’ flying last month was 50.3% ahead of where it was pre-pandemic 2019. Aside from privacy, an increasing population of UHNWs and corporate profits, airlines are still boosting private aviation providers. Last year, a Private Jet Card Comparisons survey found that 63% of subscribers considering private aviation cited airline delays and cancelations as a driving factor. Of course, the wish to fly privately is constrained by one's ability to underwrite the not-insignificant expense of paying for the flights, around $8,000 per hour for a six-seat light jet. Since I don't have $40,000 to spare, visiting Dad will have to wait. How it works out across an industry that vividly remembers the pre-2008 frenzy, the lost decade that followed the Great Recession, the bull market of 2021 and 2022, and wherever it is now, well, that’s much more difficult to say.  One Community. Many Voices. Create a free account to share your thoughts.  Our community is about connecting people through open and thoughtful conversations. We want our readers to share their views and exchange ideas and facts in a safe space. In order to do so, please follow the posting rules in our site's Terms of Service.  We've summarized some of those key rules below. Simply put, keep it civil. Your post will be rejected if we notice that it seems to contain: User accounts will be blocked if we notice or believe that users are engaged in: So, how can you be a power user? Thanks for reading our community guidelines.  Please read the full list of posting rules found in our site's Terms of Service."
  },
  {
    "title": "The Man Who Brought Theoretical Physics to Wall Street",
    "description": "If hedge-fund titan (and elite mathematician) Jim Simons wasn’t history’s greatest trader, he was among a handful who could ever make that claim.",
    "published_at": "2024-05-10T20:35:13Z",
    "content": " Things you buy through our links may earn Vox Media a commission. There are a vanishingly small number of people whose existence has changed Wall Street. One of them was Jim Simons, a former academic mathematician who brought trading closer to the world of theoretical physics — and then exploded the possibilities of how people could make, and lose, money. If he wasn’t history’s greatest trader, he was among a handful who could ever make that claim. On Friday, the Simons Foundation announced that he had died at the age of 86 in New York City. Simons grew up as the son of a Boston shoe-factory executive, but his own career started at Harvard and the Massachusetts Institute of Technology, where he taught and studied mathematics and geometry. He would eventually work as a Cold War–era code breaker but left government over his opposition to the Vietnam War. In 1978, he founded Renaissance Technologies, his hedge fund, out of a Long Island strip mall. His theory, new at the time, was that patterns existed in the ways stocks and commodities moved — and that computers could be used to predict those patterns to extraordinary effect. “I want models that will make money while I sleep,” Simons once told a friend, according to The Wall Street Journal. “A pure system without humans interfering.” Amazingly, he got it. Renaissance made about $100 billion in gains between 1988 and 2018 — an astonishing average of 66 percent a year, according to the Journal. Its Medallion Fund, which has been open only to employees, minted several billionaires. Renaissance was largely made up of mathematicians like Simons as well as physicists and other scientists. While that’s fairly commonplace among sophisticated hedge funds today, it truly revolutionized how money could be made in trading. Simons went on to be a major philanthropist and a contributor to the Democratic Party, donating more than $100 million since 2005, Bloomberg reported. On Friday, after his death was announced, some of Wall Street’s biggest names mourned his death. Jim Simons was the greatest—an unbelievably great investor, philanthropist, and man of character.  I and all who knew him will miss him. Only one investor can say their competitive advantage is \"I'm smarter than everyone else\" and it's clear that was Jim Simons. https://t.co/VbQ7BzpPC4 RIP to an absolute legend and a good man. https://t.co/1cllcCqhK9 Simons was part of a class of finance titans who transformed Wall Street in the latter part of the previous century but whose ranks are now thinning. Others in that group who have recently passed away include John C. Bogle, who popularized passive investing; Charlie Munger, who helped Warren Buffett build Berkshire Hathaway; and hedge-fund godfather Julian Robertson. RIP Jim Simons, one of the most goated ever pic.twitter.com/zOYpr9bKKR By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. Things you buy through our links may earn Vox Media a commission.                "
  },
  {
    "title": "Warren Buffett's Latest $2.6 Billion Buy Brings His Total Investment in This Stock to More Than $77 Billion in Under 6 Years",
    "description": "Last weekend, in the neighborhood of 40,000 investors flocked to Omaha for Berkshire Hathaway's (NYSE: BRK.A)(NYSE: BRK.B) annual shareholder meeting. The lure was simple: to hear the \"Oracle of Omaha,\" Warren Buffett, speak about stocks, the U.S. economy, an…",
    "published_at": "2024-05-10T18:32:07Z",
    "content": "\n        Last weekend, in the neighborhood of 40,000 investors flocked to Omaha for Berkshire Hathaway's (NYSE: BRK.A)(NYSE: BRK.B) annual shareholder meeting. The lure was simple: to hear the \"Oracle of Omaha,\" Warren Buffett, speak about stocks, the U.S. economy, and his investing philosophy for hours on end.Since taking over as the CEO of Berkshire Hathaway in the mid-1960s,…\n     \n#omaha#warrenbuffett#berkshirehathaway#tedweschler#toddcombs#occidentalpetroleum#oxy#occidental "
  },
  {
    "title": "Top ASX shares to buy for your superannuation fund in May 2024",
    "description": "Is your super working hard for you?\nThe post Top ASX shares to buy for your superannuation fund in May 2024 appeared first on The Motley Fool Australia.",
    "published_at": "2024-05-10T18:00:00Z",
    "content": null
  },
  {
    "title": "Warren Buffett Says Berkshire Hathaway Sold All of Its Paramount Stock: 'We Lost Quite a Bit of Money'",
    "description": "As Paramount comes off a rocky week in which the company lost its CEO and its exclusive merger talks window with Skydance came to an end without a deal, Berkshire Hathaway CEO Warren Buffett says his company has now sold its entire stake in Paramount. Berkshi…",
    "published_at": "2024-05-10T17:05:10Z",
    "content": "Skip to comments. Posted on 05/10/2024 10:05:10 AM PDT by SeekAndFind As Paramount comes off a rocky week in which the company lost its CEO and its exclusive merger talks window with Skydance came to an end without a deal, Berkshire Hathaway CEO Warren Buffett says his company has now sold its entire stake in Paramount. Berkshire Hathaway had previously sold a third of its stock in Paramount during the fourth quarter of last year. \"We sold it all, and we lost quite a bit of money, that happens in this business too,\" Buffett said on Saturday at Berkshire Hathaway's annual meeting in Omaha, Nebraska. He added that he was \"100% responsible\" for the Paramount decision -- both buying in and getting out.According to the company's latest available filings, Berkshire owned 63.3 million shares of Paramount Global at the end of 2023. The company disclosed a $2.6 billion stake in Paramount in 2022 and picked up even more shares after that, but now they're out. \"Owning Paramount made me think even deeper, but I certainly looked harder about the whole question of what people do with their leisure time and what the governing principles are of running an entertainment business of any sort, whether it's sports or movies or whatever it might be,\" Buffett said at the meeting. \"I think I'm smarter now than I was a couple years ago, but I also think I'm poorer because I acquired the knowledge in the matter I did.\" On Friday, after a month of exclusive talks between Paramount and Skydance, their negotiation window expired without a deal, signaling one is unlikely to happen. David Ellison's Skydance submitted a revised offer earlier this week in an effort to assuage concerns that the deal benefits non-executive chairwoman Shari Redstone over other investors.\n(Excerpt) Read more at msn.com ...\n\nTOPICS: Business/Economy; Music/Entertainment; Society; TV/Movies\nKEYWORDS: paramount; warrenbuffett\n\n\n\nClick here: to donate by Credit Card\nOr here: to donate by PayPal\nOr by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n\n\n\n\n\n1\nposted on 05/10/2024 10:05:10 AM PDT\nby SeekAndFind\n\n[\nPost Reply\n | Private Reply\n | View Replies]\n\nTo: SeekAndFind\n\nSOURCE: https://dailytradealert.com/2024/05/09/2-stocks-warren-buffett-just-confessed-to-selling/\n[EXCERPT]\nBuffett also silenced ongoing rumors about the losses Berkshire absorbed from its stake in Paramount Global by absolving top investment aides, Todd Combs and Ted Weschler and noting that “I was 100% responsible for the Paramount decision.”\nThe thumping Buffett took on his investment in Paramount can be traced to a couple of challenges. To start with, it’s been tough sledding for certain types of advertisers over the past year and change. Specifically, legacy TV networks have seen ad dollars shift to streaming platforms. Between ongoing cord-cutting and select money-based indicators forecasting a recession, advertising revenue for its legacy networks has declined.\nThe other issue for Paramount Global has been its need to build out its streaming assets and content library to counter cord-cutting. Although revenue for its direct-to-consumer (DTC) segment surged 37% last year to $6.74 billion, the DTC segment is still losing a boatload of money. While increasing monthly subscription prices is part of the recipe to shrink these losses, Paramount’s streaming segment is an undeniable drag on the company’s bottom line.\nGiven these challenges, Paramount Global’s future might entail it being acquired. Private equity company Apollo Global and Sony Pictures have sent a letter to Paramount’s board where they’ve expressed interest in paying $26 billion, including debt, to acquire the company. Paramount has also had discussions about a potential merger with Skydance Media.\n\n2\nposted on 05/10/2024 10:07:43 AM PDT\nby SeekAndFind\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: SeekAndFind\n\nBuffet: “I never invest in anything I don’t understand”\nI guess Paramount+ was an exception.\n\n3\nposted on 05/10/2024 10:10:24 AM PDT\nby Zathras\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: Zathras\n\nThas is not what I understood.\n\n4\nposted on 05/10/2024 10:28:44 AM PDT\nby jimfree\n(My 21 y/o granddaughter continues to have more quality exec experience than Joe Biden.)\n\n[\nPost Reply\n | Private Reply\n | To 3\n | View Replies]\n\nTo: SeekAndFind\n\nLast year he was saying something to the effect of ‘streaming is a tough business’ and it would get worse.\n\n5\nposted on 05/10/2024 10:33:19 AM PDT\nby posterchild\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: Zathras\n\nParamount owns CBS and MTV. They would have to be sold off-at a loss-if Sony took control of the company.\n\n6\nposted on 05/10/2024 10:34:15 AM PDT\nby kaktuskid\n\n[\nPost Reply\n | Private Reply\n | To 3\n | View Replies]\n\nTo: SeekAndFind\n\nWell hollyweird is dead to me and I’m indifferent to it’s success or failure but it’s interesting I’m not alone in my stand.\n\n7\nposted on 05/10/2024 10:35:53 AM PDT\nby xp38\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: SeekAndFind\n\nUsually the parasite makes money off of failing businesses.\n\n8\nposted on 05/10/2024 10:38:43 AM PDT\nby gov_bean_ counter\n(Eccl 10:2 - The heart of the wise inclines to the right, but the heart of the fool to the left )\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: Zathras\n\nIt’s almost like nobody wants to watch weak woke re-makes in a hyper-inflation environment. It’s a real head scratcher.\n\n9\nposted on 05/10/2024 12:02:16 PM PDT\nby BipolarBob\n(I drink coffee because my doctor said meth was bad for me.)\n\n[\nPost Reply\n | Private Reply\n | To 3\n | View Replies]\n\nTo: kaktuskid\n\nParamount owns CBS and MTV.Well the CBS morning and evening news products are the WORST. NorDUH O'donnell is always pushing feminism and Gayle King is always pushing Black stories only.\n\n10\nposted on 05/10/2024 12:04:48 PM PDT\nby 1Old Pro\n\n[\nPost Reply\n | Private Reply\n | To 6\n | View Replies]\n\nTo: 1Old Pro\n\nHistory repeats itself. One hundred years ago Paramount was nearly bankrupt and it would sell out to the gangster-ridden Balaban family.\n\n11\nposted on 05/10/2024 12:36:31 PM PDT\nby Bookshelf\n\n[\nPost Reply\n | Private Reply\n | To 10\n | View Replies]\n\nTo: SeekAndFind\n\nBuffett will be alright even after “losing quite a bit of money” on Paramount.\nIt shows even the best end up making poor investments once in awhile.\n\n12\nposted on 05/10/2024 12:46:18 PM PDT\nby unclebankster\n(Globalism is the last refuge of a scoundrel.)\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: SeekAndFind\n\nI guess he’s not really that smart after all\n\n13\nposted on 05/10/2024 1:12:20 PM PDT\nby NWFree\n(Sigma male 🤪)\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: unclebankster\n\nIn 1940, Paramount agreed to a government-instituted consent decree and it was to immediately end traditional block booking and “pre-selling”, or collecting ‘up-front’ money for films not yet in production. The decision affected all studios. Paramount cut back on production, from 71 films annually to a singularly reduced 19 in the war years. Nevertheless the studios with their integrated studio-theatre combines reportedly were more profitable than ever. However, that combo lasted only until 1948 when they were ordered dissolved by a Supreme Court decision. It was generally agreed that the Court’s judgment wrote finis to the near century-old Movie studio system. And Paramount was never the same.\n\n14\nposted on 05/10/2024 1:35:04 PM PDT\nby Bookshelf\n\n[\nPost Reply\n | Private Reply\n | To 12\n | View Replies]\n\n\nDisclaimer:\n    Opinions posted on Free Republic are those of the individual\n    posters and do not necessarily represent the opinion of Free Republic or its\n    management. All materials posted herein are protected by copyright law and the\n    exemption for fair use of copyrighted works.\n\n\n\n\n\nFree Republic\nBrowse\n  · Search\n\n\n\nGeneral/Chat\nTopics\n  · Post Article\n\n\n\n\n\nFreeRepublic, LLC, PO BOX 9771, FRESNO, CA 93794\n\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson\n\n \"We sold it all, and we lost quite a bit of money, that happens in this business too,\" Buffett said on Saturday at Berkshire Hathaway's annual meeting in Omaha, Nebraska. He added that he was \"100% responsible\" for the Paramount decision -- both buying in and getting out. According to the company's latest available filings, Berkshire owned 63.3 million shares of Paramount Global at the end of 2023. The company disclosed a $2.6 billion stake in Paramount in 2022 and picked up even more shares after that, but now they're out. \"Owning Paramount made me think even deeper, but I certainly looked harder about the whole question of what people do with their leisure time and what the governing principles are of running an entertainment business of any sort, whether it's sports or movies or whatever it might be,\" Buffett said at the meeting. \"I think I'm smarter now than I was a couple years ago, but I also think I'm poorer because I acquired the knowledge in the matter I did.\" On Friday, after a month of exclusive talks between Paramount and Skydance, their negotiation window expired without a deal, signaling one is unlikely to happen. David Ellison's Skydance submitted a revised offer earlier this week in an effort to assuage concerns that the deal benefits non-executive chairwoman Shari Redstone over other investors.\n(Excerpt) Read more at msn.com ...\n\nTOPICS: Business/Economy; Music/Entertainment; Society; TV/Movies\nKEYWORDS: paramount; warrenbuffett\n\n\n\nClick here: to donate by Credit Card\nOr here: to donate by PayPal\nOr by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n\n\n\n\n\n1\nposted on 05/10/2024 10:05:10 AM PDT\nby SeekAndFind\n\n[\nPost Reply\n | Private Reply\n | View Replies]\n\nTo: SeekAndFind\n\nSOURCE: https://dailytradealert.com/2024/05/09/2-stocks-warren-buffett-just-confessed-to-selling/\n[EXCERPT]\nBuffett also silenced ongoing rumors about the losses Berkshire absorbed from its stake in Paramount Global by absolving top investment aides, Todd Combs and Ted Weschler and noting that “I was 100% responsible for the Paramount decision.”\nThe thumping Buffett took on his investment in Paramount can be traced to a couple of challenges. To start with, it’s been tough sledding for certain types of advertisers over the past year and change. Specifically, legacy TV networks have seen ad dollars shift to streaming platforms. Between ongoing cord-cutting and select money-based indicators forecasting a recession, advertising revenue for its legacy networks has declined.\nThe other issue for Paramount Global has been its need to build out its streaming assets and content library to counter cord-cutting. Although revenue for its direct-to-consumer (DTC) segment surged 37% last year to $6.74 billion, the DTC segment is still losing a boatload of money. While increasing monthly subscription prices is part of the recipe to shrink these losses, Paramount’s streaming segment is an undeniable drag on the company’s bottom line.\nGiven these challenges, Paramount Global’s future might entail it being acquired. Private equity company Apollo Global and Sony Pictures have sent a letter to Paramount’s board where they’ve expressed interest in paying $26 billion, including debt, to acquire the company. Paramount has also had discussions about a potential merger with Skydance Media.\n\n2\nposted on 05/10/2024 10:07:43 AM PDT\nby SeekAndFind\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: SeekAndFind\n\nBuffet: “I never invest in anything I don’t understand”\nI guess Paramount+ was an exception.\n\n3\nposted on 05/10/2024 10:10:24 AM PDT\nby Zathras\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: Zathras\n\nThas is not what I understood.\n\n4\nposted on 05/10/2024 10:28:44 AM PDT\nby jimfree\n(My 21 y/o granddaughter continues to have more quality exec experience than Joe Biden.)\n\n[\nPost Reply\n | Private Reply\n | To 3\n | View Replies]\n\nTo: SeekAndFind\n\nLast year he was saying something to the effect of ‘streaming is a tough business’ and it would get worse.\n\n5\nposted on 05/10/2024 10:33:19 AM PDT\nby posterchild\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: Zathras\n\nParamount owns CBS and MTV. They would have to be sold off-at a loss-if Sony took control of the company.\n\n6\nposted on 05/10/2024 10:34:15 AM PDT\nby kaktuskid\n\n[\nPost Reply\n | Private Reply\n | To 3\n | View Replies]\n\nTo: SeekAndFind\n\nWell hollyweird is dead to me and I’m indifferent to it’s success or failure but it’s interesting I’m not alone in my stand.\n\n7\nposted on 05/10/2024 10:35:53 AM PDT\nby xp38\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: SeekAndFind\n\nUsually the parasite makes money off of failing businesses.\n\n8\nposted on 05/10/2024 10:38:43 AM PDT\nby gov_bean_ counter\n(Eccl 10:2 - The heart of the wise inclines to the right, but the heart of the fool to the left )\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: Zathras\n\nIt’s almost like nobody wants to watch weak woke re-makes in a hyper-inflation environment. It’s a real head scratcher.\n\n9\nposted on 05/10/2024 12:02:16 PM PDT\nby BipolarBob\n(I drink coffee because my doctor said meth was bad for me.)\n\n[\nPost Reply\n | Private Reply\n | To 3\n | View Replies]\n\nTo: kaktuskid\n\nParamount owns CBS and MTV.Well the CBS morning and evening news products are the WORST. NorDUH O'donnell is always pushing feminism and Gayle King is always pushing Black stories only.\n\n10\nposted on 05/10/2024 12:04:48 PM PDT\nby 1Old Pro\n\n[\nPost Reply\n | Private Reply\n | To 6\n | View Replies]\n\nTo: 1Old Pro\n\nHistory repeats itself. One hundred years ago Paramount was nearly bankrupt and it would sell out to the gangster-ridden Balaban family.\n\n11\nposted on 05/10/2024 12:36:31 PM PDT\nby Bookshelf\n\n[\nPost Reply\n | Private Reply\n | To 10\n | View Replies]\n\nTo: SeekAndFind\n\nBuffett will be alright even after “losing quite a bit of money” on Paramount.\nIt shows even the best end up making poor investments once in awhile.\n\n12\nposted on 05/10/2024 12:46:18 PM PDT\nby unclebankster\n(Globalism is the last refuge of a scoundrel.)\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: SeekAndFind\n\nI guess he’s not really that smart after all\n\n13\nposted on 05/10/2024 1:12:20 PM PDT\nby NWFree\n(Sigma male 🤪)\n\n[\nPost Reply\n | Private Reply\n | To 1\n | View Replies]\n\nTo: unclebankster\n\nIn 1940, Paramount agreed to a government-instituted consent decree and it was to immediately end traditional block booking and “pre-selling”, or collecting ‘up-front’ money for films not yet in production. The decision affected all studios. Paramount cut back on production, from 71 films annually to a singularly reduced 19 in the war years. Nevertheless the studios with their integrated studio-theatre combines reportedly were more profitable than ever. However, that combo lasted only until 1948 when they were ordered dissolved by a Supreme Court decision. It was generally agreed that the Court’s judgment wrote finis to the near century-old Movie studio system. And Paramount was never the same.\n\n14\nposted on 05/10/2024 1:35:04 PM PDT\nby Bookshelf\n\n[\nPost Reply\n | Private Reply\n | To 12\n | View Replies]\n\n\nDisclaimer:\n    Opinions posted on Free Republic are those of the individual\n    posters and do not necessarily represent the opinion of Free Republic or its\n    management. All materials posted herein are protected by copyright law and the\n    exemption for fair use of copyrighted works.\n\n\n\n\n\nFree Republic\nBrowse\n  · Search\n\n\n\nGeneral/Chat\nTopics\n  · Post Article\n\n\n\n\n\nFreeRepublic, LLC, PO BOX 9771, FRESNO, CA 93794\n\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson\n\n On Friday, after a month of exclusive talks between Paramount and Skydance, their negotiation window expired without a deal, signaling one is unlikely to happen. David Ellison's Skydance submitted a revised offer earlier this week in an effort to assuage concerns that the deal benefits non-executive chairwoman Shari Redstone over other investors. (Excerpt) Read more at msn.com ... Click here: to donate by Credit Card\nOr here: to donate by PayPal\nOr by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n Or here: to donate by PayPal\nOr by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n Or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n \r\nThank you very much and God bless you.\r\n SOURCE: https://dailytradealert.com/2024/05/09/2-stocks-warren-buffett-just-confessed-to-selling/ [EXCERPT] Buffett also silenced ongoing rumors about the losses Berkshire absorbed from its stake in Paramount Global by absolving top investment aides, Todd Combs and Ted Weschler and noting that “I was 100% responsible for the Paramount decision.” The thumping Buffett took on his investment in Paramount can be traced to a couple of challenges. To start with, it’s been tough sledding for certain types of advertisers over the past year and change. Specifically, legacy TV networks have seen ad dollars shift to streaming platforms. Between ongoing cord-cutting and select money-based indicators forecasting a recession, advertising revenue for its legacy networks has declined. The other issue for Paramount Global has been its need to build out its streaming assets and content library to counter cord-cutting. Although revenue for its direct-to-consumer (DTC) segment surged 37% last year to $6.74 billion, the DTC segment is still losing a boatload of money. While increasing monthly subscription prices is part of the recipe to shrink these losses, Paramount’s streaming segment is an undeniable drag on the company’s bottom line. Given these challenges, Paramount Global’s future might entail it being acquired. Private equity company Apollo Global and Sony Pictures have sent a letter to Paramount’s board where they’ve expressed interest in paying $26 billion, including debt, to acquire the company. Paramount has also had discussions about a potential merger with Skydance Media. Buffet: “I never invest in anything I don’t understand”\nI guess Paramount+ was an exception. Thas is not what I understood. Last year he was saying something to the effect of ‘streaming is a tough business’ and it would get worse. Paramount owns CBS and MTV. They would have to be sold off-at a loss-if Sony took control of the company. Well hollyweird is dead to me and I’m indifferent to it’s success or failure but it’s interesting I’m not alone in my stand. Usually the parasite makes money off of failing businesses. It’s almost like nobody wants to watch weak woke re-makes in a hyper-inflation environment. It’s a real head scratcher. Well the CBS morning and evening news products are the WORST. NorDUH O'donnell is always pushing feminism and Gayle King is always pushing Black stories only.\n History repeats itself. One hundred years ago Paramount was nearly bankrupt and it would sell out to the gangster-ridden Balaban family. Buffett will be alright even after “losing quite a bit of money” on Paramount. It shows even the best end up making poor investments once in awhile. I guess he’s not really that smart after all In 1940, Paramount agreed to a government-instituted consent decree and it was to immediately end traditional block booking and “pre-selling”, or collecting ‘up-front’ money for films not yet in production. The decision affected all studios. Paramount cut back on production, from 71 films annually to a singularly reduced 19 in the war years. Nevertheless the studios with their integrated studio-theatre combines reportedly were more profitable than ever. However, that combo lasted only until 1948 when they were ordered dissolved by a Supreme Court decision. It was generally agreed that the Court’s judgment wrote finis to the near century-old Movie studio system. And Paramount was never the same. \n\nDisclaimer:\n    Opinions posted on Free Republic are those of the individual\n    posters and do not necessarily represent the opinion of Free Republic or its\n    management. All materials posted herein are protected by copyright law and the\n    exemption for fair use of copyrighted works.\n\n\n\n\n\nFree Republic\nBrowse\n  · Search\n\n\n\nGeneral/Chat\nTopics\n  · Post Article\n\n\n\n\n\nFreeRepublic, LLC, PO BOX 9771, FRESNO, CA 93794\n\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson\n\n \nDisclaimer:\n    Opinions posted on Free Republic are those of the individual\n    posters and do not necessarily represent the opinion of Free Republic or its\n    management. All materials posted herein are protected by copyright law and the\n    exemption for fair use of copyrighted works.\n"
  },
  {
    "title": "Bombshells From Warren Buffett Shock Investors: Why did he sell so much of his biggest holding - Apple?",
    "description": "If you haven’t tuned into the annual Berkshire Hathaway shareholder meeting to see highlights, a certain moment is grabbing headlines but another more nuanced one is where your attention should go.The most poignant moment of the day was when Warren turned to …",
    "published_at": "2024-05-10T16:29:11Z",
    "content": "Skip to comments. Posted on 05/10/2024 9:29:11 AM PDT by SeekAndFind If you haven’t tuned into the annual Berkshire Hathaway shareholder meeting to see highlights, a certain moment is grabbing headlines but another more nuanced one is where your attention should go.The most poignant moment of the day was when Warren turned to his new right-hand man Greg Able but invited former lieutenant Charlie Munger for his views. The simple question “Charlie?” was enough to melt hearts as it became clear the one-two punch duo of Charlie and Warren that had been a staple of these Woodstock for Capitalists meetings for decades still lived on in Warren, and is a habit that will be hard to break.That clip is the one that has gone viral for the obvious emotional tug but another comment by Buffett should be reverberating around the world because it has enormous consequences to your wealth.Key PointsWarren Buffett heartfelt invitation to ask Charlie Munger to comment stole the spotlight at the Berkshire Hathaway meeting, showcasing their enduring partnership even after Charlie’s passing.Buffett’s decision to sell Apple stock for tax reasons reveals his anticipation of future tax hikes, emphasizing the financial benefits of selling now over waiting.Selling Apple reflects Buffett’s strategy to build cash reserves, enabling him to capitalize on future market opportunities, echoing his actions during the 2008-09 financial crisis.The Frightening Thing Buffett SaidAt one point during the meeting Buffett was asked why did you sell so much Apple? He went on a rambling explanation that at the time seemed a little disjointed but when you arrived at the conclusion it was clear he was sewing various themes together to explain precisely why he sold Apple.The short answer is Buffett claims to have sold Apple for tax reasons. It’s a remarkable statement in light of his usual criteria to buy and sell based on company reasons not tax ones but to peel back the layers of the onion reveals the full story.Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. If you haven’t tuned into the annual Berkshire Hathaway shareholder meeting to see highlights, a certain moment is grabbing headlines but another more nuanced one is where your attention should go.The most poignant moment of the day was when Warren turned to his new right-hand man Greg Able but invited former lieutenant Charlie Munger for his views. The simple question “Charlie?” was enough to melt hearts as it became clear the one-two punch duo of Charlie and Warren that had been a staple of these Woodstock for Capitalists meetings for decades still lived on in Warren, and is a habit that will be hard to break.That clip is the one that has gone viral for the obvious emotional tug but another comment by Buffett should be reverberating around the world because it has enormous consequences to your wealth.Key PointsWarren Buffett heartfelt invitation to ask Charlie Munger to comment stole the spotlight at the Berkshire Hathaway meeting, showcasing their enduring partnership even after Charlie’s passing.Buffett’s decision to sell Apple stock for tax reasons reveals his anticipation of future tax hikes, emphasizing the financial benefits of selling now over waiting.Selling Apple reflects Buffett’s strategy to build cash reserves, enabling him to capitalize on future market opportunities, echoing his actions during the 2008-09 financial crisis.The Frightening Thing Buffett SaidAt one point during the meeting Buffett was asked why did you sell so much Apple? He went on a rambling explanation that at the time seemed a little disjointed but when you arrived at the conclusion it was clear he was sewing various themes together to explain precisely why he sold Apple.The short answer is Buffett claims to have sold Apple for tax reasons. It’s a remarkable statement in light of his usual criteria to buy and sell based on company reasons not tax ones but to peel back the layers of the onion reveals the full story.Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. If you haven’t tuned into the annual Berkshire Hathaway shareholder meeting to see highlights, a certain moment is grabbing headlines but another more nuanced one is where your attention should go.The most poignant moment of the day was when Warren turned to his new right-hand man Greg Able but invited former lieutenant Charlie Munger for his views. The simple question “Charlie?” was enough to melt hearts as it became clear the one-two punch duo of Charlie and Warren that had been a staple of these Woodstock for Capitalists meetings for decades still lived on in Warren, and is a habit that will be hard to break.That clip is the one that has gone viral for the obvious emotional tug but another comment by Buffett should be reverberating around the world because it has enormous consequences to your wealth.Key PointsWarren Buffett heartfelt invitation to ask Charlie Munger to comment stole the spotlight at the Berkshire Hathaway meeting, showcasing their enduring partnership even after Charlie’s passing.Buffett’s decision to sell Apple stock for tax reasons reveals his anticipation of future tax hikes, emphasizing the financial benefits of selling now over waiting.Selling Apple reflects Buffett’s strategy to build cash reserves, enabling him to capitalize on future market opportunities, echoing his actions during the 2008-09 financial crisis.The Frightening Thing Buffett SaidAt one point during the meeting Buffett was asked why did you sell so much Apple? He went on a rambling explanation that at the time seemed a little disjointed but when you arrived at the conclusion it was clear he was sewing various themes together to explain precisely why he sold Apple.The short answer is Buffett claims to have sold Apple for tax reasons. It’s a remarkable statement in light of his usual criteria to buy and sell based on company reasons not tax ones but to peel back the layers of the onion reveals the full story.Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. The most poignant moment of the day was when Warren turned to his new right-hand man Greg Able but invited former lieutenant Charlie Munger for his views. The simple question “Charlie?” was enough to melt hearts as it became clear the one-two punch duo of Charlie and Warren that had been a staple of these Woodstock for Capitalists meetings for decades still lived on in Warren, and is a habit that will be hard to break.That clip is the one that has gone viral for the obvious emotional tug but another comment by Buffett should be reverberating around the world because it has enormous consequences to your wealth.Key PointsWarren Buffett heartfelt invitation to ask Charlie Munger to comment stole the spotlight at the Berkshire Hathaway meeting, showcasing their enduring partnership even after Charlie’s passing.Buffett’s decision to sell Apple stock for tax reasons reveals his anticipation of future tax hikes, emphasizing the financial benefits of selling now over waiting.Selling Apple reflects Buffett’s strategy to build cash reserves, enabling him to capitalize on future market opportunities, echoing his actions during the 2008-09 financial crisis.The Frightening Thing Buffett SaidAt one point during the meeting Buffett was asked why did you sell so much Apple? He went on a rambling explanation that at the time seemed a little disjointed but when you arrived at the conclusion it was clear he was sewing various themes together to explain precisely why he sold Apple.The short answer is Buffett claims to have sold Apple for tax reasons. It’s a remarkable statement in light of his usual criteria to buy and sell based on company reasons not tax ones but to peel back the layers of the onion reveals the full story.Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. That clip is the one that has gone viral for the obvious emotional tug but another comment by Buffett should be reverberating around the world because it has enormous consequences to your wealth.Key PointsWarren Buffett heartfelt invitation to ask Charlie Munger to comment stole the spotlight at the Berkshire Hathaway meeting, showcasing their enduring partnership even after Charlie’s passing.Buffett’s decision to sell Apple stock for tax reasons reveals his anticipation of future tax hikes, emphasizing the financial benefits of selling now over waiting.Selling Apple reflects Buffett’s strategy to build cash reserves, enabling him to capitalize on future market opportunities, echoing his actions during the 2008-09 financial crisis.The Frightening Thing Buffett SaidAt one point during the meeting Buffett was asked why did you sell so much Apple? He went on a rambling explanation that at the time seemed a little disjointed but when you arrived at the conclusion it was clear he was sewing various themes together to explain precisely why he sold Apple.The short answer is Buffett claims to have sold Apple for tax reasons. It’s a remarkable statement in light of his usual criteria to buy and sell based on company reasons not tax ones but to peel back the layers of the onion reveals the full story.Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. At one point during the meeting Buffett was asked why did you sell so much Apple? He went on a rambling explanation that at the time seemed a little disjointed but when you arrived at the conclusion it was clear he was sewing various themes together to explain precisely why he sold Apple.The short answer is Buffett claims to have sold Apple for tax reasons. It’s a remarkable statement in light of his usual criteria to buy and sell based on company reasons not tax ones but to peel back the layers of the onion reveals the full story.Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. The short answer is Buffett claims to have sold Apple for tax reasons. It’s a remarkable statement in light of his usual criteria to buy and sell based on company reasons not tax ones but to peel back the layers of the onion reveals the full story.Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. Buffett made it clear during his initial soliloquy that the current fiscal situation is simply untenable. Taxes will rise, he stated bluntly. By selling Apple now, Berkshire Hathaway can pocket more of its share of the proceeds and pay the government less than will be the case in the future, in his estimation.Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. Now here’s the kicker that most people overlook. The gains in Apple that Buffett forecasts are not going to eclipse the differential tax liability. Or in other words, Buffett either thinks Apple won’t go up so much from here versus the difference Berkshire pockets in what it keeps now versus later when tax hikes are factored in.To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. To keep the math simple. Imagine that Buffett believes at the 21% rate now that $1 billion in gains results in $210 million to Berkshire and $790 million to Berkshire. In the future, if taxes rise to 30%, Berkshire keeps $700 million and Uncle Sam gets $300 million. So the differential the company loses in its cash pile by not selling now is $90 million.If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. If Buffett held the shares for longer, he doesn’t expect them to go up far enough to offset the increase in tax liability hike. So clearly he thinks taxes are going to go up by more than that proportion of his Apple share ownership.What’s The Takeaway?Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. Buffett had another takeaway in his discussion on the topic which is raising cash now is a priority because he expects a calamity at some point just as the 2008-09 market led to massive opportunities.He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. He also expressed some regret that he didn’t handle that situation as well as he could, a remarkable statement given how he snapped up huge positions in Goldman Sachs, Bank of America and others at the time using a large cash hoard.Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. Clearly raising cash by selling Apple now and locking in higher percentage of the proceeds versus what Berkshire would capture later is more important to Buffett than whatever marginal gains are likely to accrue near-term.The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. The same strategy can be applied to the ordinary investors too. If sitting on massive capital gains and you expect taxes to rise too, and better prices to follow later, selling now and sitting tight for a crisis may well be among the smarter plays. But, like Buffett, only with a small percentage of the overall portfolio. Click here: to donate by Credit Card\nOr here: to donate by PayPal\nOr by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n Or here: to donate by PayPal\nOr by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n Or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\r\n\r\nThank you very much and God bless you.\r\n \r\nThank you very much and God bless you.\r\n I suspect Apple is going under. Maybe not immediately but they’re on the way down and Buffett is bailing out to minimize his risk of loss. This is actually the second consecutive quarter that Berkshire’s largest position by market value has been pared down by the company’s brightest investment minds. The logic behind this recent selling likely has to do with corporate taxation. Whereas the roughly 10 million shares of Apple sold during the fourth quarter were to offset select investment losses, the capital gains Buffett’s company recognized from selling 115 million shares of Apple in the first quarter may have to do with front-running fiscal policy changes in Washington, D.C. At the moment, the peak federal corporate income tax rate is 21%. President Joe Biden has proposed increasing the peak rate to 28%. With higher tax rates likely in the future, Buffett has opined that investors won’t gripe about locking in gains now at a lower corporate tax rate. Despite selling around 125 million shares of Apple, combined, over the previous two quarters, the Oracle of Omaha has made clear that it’s going to be a longtime holding for Berkshire Hathaway. Apple is going under just at the DOJ is suing them for having a monopoly on mobile phones. LOL!!! It doesn’t matter what Buffet does. I watch what Pelosi and the rest of the corrupt Congress members trade. Buffet still says Apple is best company in the world and has a great future. He still owns $174 billion of it, or about 40% of Berkshire’s total value. That’s about four times bigger than Berkshire’s second-biggest public stock holding, Bank of America, and makes Berkshire the No. 2 Apple shareholder, behind only Vanguard. This is a little pruning after a huge run, not a running away. Do you have 40% of your investments in one stock? If you do, you must think highly of it.  With the $billions in his portfolio it is prudent to redirect cash from your largest position when it has grown substantially, and growth is slowing, to allocate to areas of either greater return, or safety.\n That was my understanding also, it grew to such a size that it was prudent to prune. One can watch the whole 6.5+ hour event (starts at about 30 minutes in) https://www.youtube.com/watch?v=X3wLdzddRtI rather than trust that a ‘journalist’ would pick out the meaningful ‘highlights’ or ‘bombshells’ especially if they can’t even get the names right. sound like buffet thinks the current market top will soon be a market drop due to the bidenistas’ MASSIVE proposed tax increase ... “Do you have 40% of your investments in one stock?” Depends on what’s going on. In 2020 Carnival Cruises was undervalued and I had 50% of my portfolio in it. I bought part at $8.25 and I made another purchase at $7.70. I sold it all when it hit $25. My other fortunate move was being an early protester buying GameStop in September 2019 and holding it. It was like $1.25 at the time. I sold most of it at $50 while keeping my original capital invested in it. Right now the only thing I’m really into is US Gold Corp. and it looks good for now. I bought it mostly because it’s creating jobs in Wyoming. Apple has attached itself to China and then has doubled down. That is a very dangerous strategy in today’s world. “That is a very dangerous strategy in today’s world.” I agree. If China attacks and invades Taiwan then China and everything in China will be sanctioned and that includes everything Apple produces in China. That alone is why I will not buy any stocks that are exposed to risk from sanctions. “With the $billions in his portfolio it is prudent to redirect cash from your largest position when it has grown substantially, and growth is slowing, to allocate to areas of either greater return, or safety.” Yep - they call that “rebalancing”. It’s an attempt to beat the market (buy and hold). Its drawback is that you have to beat the market by more than the tax rate - very, very tough to do over the long run - , since you’re paying capital gains taxes on the winners you sold. Might work better in an IRA. Still questionable that it’s better than buy and hold. So saving on capital gains taxes. I thought ole Warren wanted to pay more taxes. Apple just announced they are buying back $110 Billion of their own shares BINGO When Steve Jobs died the writing was on the wall for Apple. It’s been a dead man walking ever since. It helps to read the article. \n\nNavigation: use the links below to view more comments.\nfirst 1-20, 21-24 next last\n\n\nDisclaimer:\n    Opinions posted on Free Republic are those of the individual\n    posters and do not necessarily represent the opinion of Free Republic or its\n    management. All materials posted herein are protected by copyright law and the\n    exemption for fair use of copyrighted works.\n\n\n\n\n\nFree Republic\nBrowse\n  · Search\n\n\n\nGeneral/Chat\nTopics\n  · Post Article\n\n\n\n\n\nFreeRepublic, LLC, PO BOX 9771, FRESNO, CA 93794\n\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson\n\n \nDisclaimer:\n    Opinions posted on Free Republic are those of the individual\n    posters and do not necessarily represent the opinion of Free Republic or its\n    management. All materials posted herein are protected by copyright law and the\n    exemption for fair use of copyrighted works.\n"
  },
  {
    "title": "Jones Lang LaSalle Incorporated : Johns Manville signs new lease to keep world headquarters in Denver",
    "description": "(marketscreener.com) \n DENVER - May 8, 2024 - Johns Manville , a leading manufacturer of premium-quality building and specialty products and a Berkshire Hathaway company, announced today its world headquarters will stay in downtown Denver through at least 203…",
    "published_at": "2024-05-10T16:03:08Z",
    "content": null
  },
  {
    "title": "The freshest business trends agents need to recognize in 2024",
    "description": "The business of selling real estate is evolving at an ever-escalating pace. If you can identify some of the emerging trends and begin to act on those trends, Jimmy Burgess writes, you'll separate yourself from your competition like never before.",
    "published_at": "2024-05-10T15:55:14Z",
    "content": "Canva The business of selling real estate is evolving at an ever-escalating pace. If you can identify some of the emerging trends and begin to act on those trends, Jimmy Burgess writes, you’ll separate yourself from your competition like never before. Inman Connect At Inman Connect Las Vegas, July 30-Aug. 1, 2024, the noise and misinformation will be banished, all your big questions will be answered, and new business opportunities will be revealed. Join us. Hall of Famer Wayne Gretzky famously said, “A good hockey player plays where the puck is. A great hockey player plays where the puck will be.”  The business of selling real estate is evolving at an ever-escalating pace. If you can identify some of the emerging trends and begin to act on those trends — proverbially skating to where the puck will be — you’ll be able to separate yourself from your competition like never before. Here are seven up-and-coming trends that you can utilize to grow your business in 2024. A personal brand is a culmination of sharing your experiences, skills, and what you stand for in a way that attracts your ideal clients. Personal brands take time to develop and the most successful agent in your market is usually the agent with the strongest personal brand.  Forbes published an article on Feb. 6, 2024, titled, “Why 2024 is the Year to Build Your Personal Brand.” In the article they state the following: In today’s marketplace, entrepreneurs face a daunting challenge: standing out. With thousands of voices clamoring for attention, being just another face in the crowd is not an option. The statistics are clear: A staggering 77 percent of consumers prefer to purchase from a brand they recognize.  Yet, many entrepreneurs struggle to establish this recognition. They grapple with an overcrowded market, ever-changing algorithms and a landscape in which consumer loyalty is hard-won. Their brilliant ideas and hard work often go unnoticed, not because they lack value but because they lack visibility.  This struggle isn’t just frustrating; it’s also costly. Without a distinct personal brand, entrepreneurs risk being overlooked, losing potential clients to more visible competitors and missing out on crucial growth opportunities. The time is now to double down on your efforts to build a personal brand that is recognized and trusted in your local market. The number of referral fees paid in transactions is increasing and the data hints that this will continue into the future. The addition of online programs like Zillow Flex and websites that provide leads for a referral fee at the time of closing continues to gain steam. The NAR 2023 Home Buyers and Sellers Generational Trends survey adds interesting data that indicates this trend will continue to escalate as people between the ages of 24 and 42 years old become more active in the market as they age. This survey from the 2023 NAR Home Buyers and Sellers Generation Trends shows that the overall average percentage of homebuyers surveyed who were referred to an agent by a friend, neighbor or relative was 38 percent. The average percentage rate of homebuyers surveyed who were referred by an agent to another agent was 6 percent and the average percentage of buyers referred by their employer or relocation company was 1 percent.  This means on average for the people surveyed, not including any referral websites or programs like Zillow Flex, 45 percent of buyer side transactions were the result of a referral.  But if you notice, for buyers between the ages of 24 and 32, the percentage of buyers that were the product of the three referral sources mentioned in the previous paragraph combined was 58 percent. The percentages for the same three referral sources for people between the ages of 33 and 42 was 53 percent — again, well above the average for buyers of all ages in the survey. The numbers on the homeseller side confirm this trend with younger homesellers as well (see chart below).   The average percentage of homesellers surveyed who were referred to an agent by a friend, neighbor or relative was 36 percent. The average percentage rate of homebuyers surveyed who were referred by an agent to another agent was 5 percent and the average percentage of buyers referred by their employer or relocation company was 1 percent.  This means, on average, before any referral websites or programs like Zillow Flex, 42 percent of all seller-side transactions were the result of a referral.   Just as with buyers, the percentage of homesellers referred by these three referral sources combined was 50 percent for sellers between the age of 24 and 32. The percentages for the same three referral sources for people between the ages of 33 and 42 was 46 percent, again above the average for homesellers of all ages. This trend should remind you to focus on your sphere of influence, past clients and agents in feeder markets who can develop into consistent referral partners. There are online lead generation sources that are still producing at a high level. But the number of leads sold on an annual basis continues to far exceed the number of closed transactions, leading to a decline in the value of online leads. With conversion rates less than 1 percent on the low end and 4 percent on the high end, the expense of the leads can be cost-prohibitive. However, the amount of time needed to devote to proper follow-up to get a conversion is increasing as automated drip campaigns and automated AI bot follow-up becomes the norm. It continues to be harder and harder to stand out from the crowd when it comes to leads generated online. If you decide to purchase online leads, make sure you have a systematized follow-up program in place before purchasing the leads, and go into it knowing the challenges the average agent faces converting these leads. According to Testimonial Tree, 79 percent of people trust a review they read online as much as a personal recommendation. They also state that consumers trust peer recommendations like online reviews 6.5 times more than traditional advertising. The value of online reviews compounds over time. They continue to work for you in the future and the trust potential buyers and sellers have in you grows with every review you receive. Invest the time and effort in gathering more reviews and you will be rewarded.  The emergence of AI and the unlimited ways it can create efficiencies for agents continues to shape our changing industry. From content creation to building systems that save time and effort, AI will only become more valuable to agents as it evolves. I believe with all my heart that AI will not replace professional, relationship-driven real estate agents. But I also believe the agents who embrace the technology and apply it in their businesses will outperform those who do not in the future. In the aftermath of the NAR settlement, the need to build a listing-based business has never been clearer. If you are going to invest in training, technology or tools for your business in 2024, make sure they are focused on helping you generate more listings. I know you’re thinking, “Here we go again, talking about video.” But here are a few statistics from Sprout Social to hopefully help you grasp the value of video content in your business. Video, video, video. It is a marketing trend that will continue to shape the success model now and in the future for the best agents. The trends are your friends. Lean into the opportunities the future holds, and you will see results. Jimmy Burgess is the CEO for Berkshire Hathaway HomeServices Beach Properties of Florida in Northwest Florida. Connect with him on Instagram and LinkedIn. Simply enter the email address you used to create your account and click \"Reset Password\". You will receive additional instructions via email. Forgot your username? If so please contact customer support at (510) 658-9252 Password Reset Instructions have been sent to  Please contact the parent account holder or Inman customer service @ 1-800-775-4662 customerservice@inman.com. Coalesce's Select Membership is no longer active. Sign up for Individual Select membership today. Please update your billing information to reactivate your membership. You will be charged . Your subscription will automatically renew for  on . For more details on our payment terms and how to cancel, click here."
  },
  {
    "title": "Wall Street Thinks This Warren Buffett AI Stock Pick Has 38% Upside",
    "description": "It’s no surprise that when Warren Buffett and Berkshire Hathaway Inc. (NYSE: BRK-A) part with shares of Apple Inc. (NASDAQ: AAPL), the largest stake in the Berkshire portfolio, it makes headlines. The so-called Oracle of Omaha is probably the best-known inves…",
    "published_at": "2024-05-10T14:02:07Z",
    "content": "\n        It’s no surprise that when Warren Buffett and Berkshire Hathaway Inc. (NYSE: BRK-A) part with shares of Apple Inc. (NASDAQ: AAPL), the largest stake in the Berkshire portfolio, it makes headlines. The so-called Oracle of Omaha is probably the best-known investor in the world, certainly one of the most successful. Millions of investors and aspiring investors still hang on his…\n     \n#warrenbuffett#berkshirehathawayinc#appleinc#oracleofomaha#apple#berkshire#snowflakeinc#datacloud "
  },
  {
    "title": "Global Meat and Poultry Processing Equipment Market 2024-2033: Increasing Demand for Ready-To-Eat (RTE) Foods Driving Market Growth",
    "description": "Dublin, May 10, 2024 (GLOBE NEWSWIRE) -- The \"Meat and Poultry Processing Equipment Global Market Report 2024\" report has been added to ResearchAndMarkets.com's offering.The global meat and poultry processing equipment market has grown strongly in recent year…",
    "published_at": "2024-05-10T13:05:00Z",
    "content": "\n\n\nMay 10, 2024 09:05 ET\n\n\r\n            | Source:\r\n            \nResearch and Markets\n\n\n\n\n\nResearch and Markets\n Dublin, May  10, 2024  (GLOBE NEWSWIRE) -- The \"Meat and Poultry Processing Equipment Global Market Report 2024\" report has been added to  ResearchAndMarkets.com's offering.The global meat and poultry processing equipment market has grown strongly in recent years. It will grow from $11.72 billion in 2023 to $12.82 billion in 2024 at a compound annual growth rate (CAGR) of 9.4%. The expansion observed in the historical period can be attributed to factors such as a focus on sustainability and efficiency in meat and poultry processing, the impact of the industrial revolution and mechanization, the implementation of food safety regulations, the effects of growing urbanization and increased demand, and the emphasis on quality control and standardization in the industry.The meat and poultry processing equipment market is expected to see strong growth in the next few years. It will grow to $18.16 billion in 2028 at a compound annual growth rate (CAGR) of 9.1%. The anticipated growth in the forecast period can be attributed to a heightened focus on food safety and hygiene, the increasing demand for processed foods, the adoption of sustainable processing practices, customization, and flexibility in production, as well as market expansion in developing regions. Major trends expected in the forecast period include the integration of automation and robotics, enhanced food safety measures, a greater emphasis on hygienic design, adaptation to changing consumer demands, and an ongoing commitment to efficiency and sustainability in the meat and poultry processing industry.The anticipated increase in the consumption of processed meat and poultry products is set to drive the growth of the meat and poultry processing equipment market. Notably, the global meat production rose from 337.18 million tons in 2020 to 339 million tons in 2021, according to the Food and Agriculture Organization. This rise in consumption underscores the heightened demand for processed meat and poultry, consequently fueling the meat and poultry processing equipment market.The increasing demand for ready-to-eat (RTE) foods is poised to contribute to the growth of the meat and poultry processing equipment market. For instance, the retail sales of packaged foods in Japan are predicted to reach $235.9 billion by 2026, reflecting a 9.1% increase from 2022, as per the Food Export Association of the Midwest USA. This surge in the demand for RTE foods is a significant driver for the meat and poultry processing equipment market.Technological advancements emerge as a prominent trend in the meat and poultry processing equipment market. Key industry players are concentrating on developing innovative products equipped with advanced technologies to strengthen their market position. GEA Group AG, a Germany-based food processing technology company, introduced the CutMaster Generation 3 in May 2022. This product incorporates customer-driven technological upgrades, featuring an integrated AC drive for enhanced flexibility, easy power supply, and maintenance-free operation.Major companies in the meat and poultry processing equipment market are also focusing on introducing innovative products such as physical contaminant detection solutions. These solutions employ various technologies to identify and remove foreign objects or contaminants, ensuring product safety and quality. Eagle Product Inspection, a US-based provider of x-ray inspection technology, launched MAXIMIZER RMI in August 2023. This automated reject management system is designed to enhance the quality and safety of chicken products by providing bone and metal detection in poultry operations.In June 2022, Marel, an Iceland-based multinational food processing company, acquired Wenger Manufacturing LLC for $540 million. This strategic acquisition aims to help Marel meet the growing consumer demand for high-quality and sustainably produced food and feed. Wenger Manufacturing LLC specializes in pet food, plant-based proteins, and aquafeed processing solutions.North America was the largest region in the meat and poultry equipment market in 2023. The regions covered in the meat and poultry processing equipment market report are Asia-Pacific, Western Europe, Eastern Europe, North America, South America, Middle East, Africa. The countries covered in the meat and poultry processing equipment market report are Australia, Brazil, China, France, Germany, India, Indonesia, Japan, Russia, South Korea, UK, USA, Canada, Italy, Spain.Scope Markets Covered:1) By Equipment Type: Killing and Defeathering; Cut Up; Evisceration; Marination and Tumbling; Deboning and Skinning; Other Equipment Type2) By Processing Type: Raw-Cooked Meat; Freshly processed Meat; Precooked; Cured Meat; Raw Fermented Meat; Dried Meat; Other Processing Types3) By Meat Type: Cattle; Chicken; Duck; Pig; Rabbit; Sheep; TurkeyKey Companies Mentioned: Baader Food Processing Machinery; Bayle SA; Bettcher Industries Inc.; Brower Equipment; C.G. Manufacturing & Distribution Inc.Time Series: Five years historic and ten years forecastData: Ratios of market size and growth to related markets, GDP proportions, expenditure per capitaData Segmentation: Country and regional historic and forecast data, market share of competitors, market segments A selection of companies mentioned in this report includes, but is not limited to: For more information about this report visit https://www.researchandmarkets.com/r/6pve0u About ResearchAndMarkets.comResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends."
  },
  {
    "title": "Warren Buffett had to work from his iPhone for days after lines went down at Berkshire Hathaway",
    "description": "None Warren Buffett slashed his Apple stake then found himself forced to work from his iPhone. • None The investor turned to the device after phone lines went down this week at Berkshire Hathaway HQ. • None \"I'm glad we didn't sell all of our Apple,\" Buffett …",
    "published_at": "2024-05-10T12:38:07Z",
    "content": "\n        None Warren Buffett slashed his Apple stake then found himself forced to work from his iPhone.• None The investor turned to the device after phone lines went down this week at Berkshire Hathaway HQ.• None \"I'm glad we didn't sell all of our Apple,\" Buffett joked to The Omaha World-Herald.Warren Buffett may be cursing the universe for its wicked sense of humor.The famed…\n     \n#warrenbuffett#apple#berkshirehathawayhq#omahaworldherald#iphone "
  },
  {
    "title": "Berkshire Hathaway Profits Dropped 64%, but 5 Warren Buffett Dividend Stocks Ruled Q1",
    "description": "If any investor has stood the test of time, it is Warren Buffett, and with good reason. For years, the “Oracle of Omaha” has had a rock-star-like presence in the investing world, and his annual Berkshire Hathaway shareholders meeting last weekend drew thousan…",
    "published_at": "2024-05-10T12:10:06Z",
    "content": "\n        If any investor has stood the test of time, it is Warren Buffett, and with good reason. For years, the “Oracle of Omaha” has had a rock-star-like presence in the investing world, and his annual Berkshire Hathaway shareholders meeting last weekend drew thousands of loyal fans who are investors. Known for his long buy-and-hold strategies and massive portfolio of public and…\n     \n#warrenbuffett#warrenbuffet#apple#berkshirehathaway#paramount#omaha#nebraska#gmac "
  },
  {
    "title": "Warren Buffett had to work from his iPhone for days after lines went down at Berkshire Hathaway",
    "description": "Warren Buffett. Getty Images / Bill Pugliano Warren Buffett slashed his Apple stake then found himself forced to work from his iPhone. The investor turned to the device after phone lines went down this week at Berkshire Hathaway HQ. \"I'm glad we didn't sell a…",
    "published_at": "2024-05-10T11:30:05Z",
    "content": "\n        Warren Buffett.Getty Images / Bill PuglianoWarren Buffett slashed his Apple stake then found himself forced to work from his iPhone.The investor turned to the device after phone lines went down this week at Berkshire Hathaway HQ.\"I'm glad we didn't sell all of our Apple,\" Buffett joked to The Omaha World-Herald.Warren Buffett may be cursing the universe for its wicked…\n     \n#warrenbuffett#billpugliano#apple#berkshirehathawayhq#omahaworldherald#iphone "
  },
  {
    "title": "Warren Buffett had to work from his iPhone for days after lines went down at Berkshire Hathaway",
    "description": "Two days after disclosing his Apple stock sales, Warren Buffett found himself relying on his iPhone during an outage at Berkshire Hathaway's offices.",
    "published_at": "2024-05-10T11:21:23Z",
    "content": "       Warren Buffett may be cursing the universe for its wicked sense of humor. The famed investor revealed during Berkshire Hathaway's annual shareholder meeting on Saturday that he'd slashed his Apple stake. Two days later, he walked into his company's headquarters to find the phone lines were down, forcing him to work from his iPhone. \"I don't know how to do much with it, but I do know how to answer calls,\" Buffett, 93, told The Omaha World-Herald on Wednesday when the local outage had not yet been resolved.  \n                              Related stories\n                             \"I'm glad we didn't sell all of our Apple,\" he quipped. Buffett famously spends his days analyzing companies and conversing on the phone, so the outage was a major headache for him — especially as he left his cellphone at home on Monday. \"We had this meeting that went over very well all weekend, and now to anybody who has phoned us in the last three days, they think we have gone out of business,\" Buffett joked to his hometown newspaper. He was nodding to Berkshire cashing in 13% of its Apple stake for roughly $20 billion last quarter. At the end of December, the position was worth $174 billion and made up nearly half of Berkshire's $353 billion portfolio. Berkshire's disposals, and an 11% drop in Apple's stock price, cut the holding's value to $135 billion, or 40% of the portfolio at the end of March. Buffett is unabashedly old school and proudly frugal. Berkshire follows suit despite commanding a near-$900 billion valuation and ranking among the nation's 10 largest public companies. For example, Berkshire's corporate homepage is a list of hyperlinks straight out of the 1990s: Buffett's tech skepticism made his massive bet on Apple a surprise to many people. But the investor has pointed to the iPhone's immense appeal and how indispensable it is to users. He got a taste of just how much people rely on it this week. \n                              Read next\n                             Jump to"
  },
  {
    "title": "[Removed]",
    "description": "[Removed]",
    "published_at": "1970-01-01T00:00:00Z",
    "content": null
  },
  {
    "title": "Warren Buffett’s most recent purchase of $2.6 billion increases his total investment in this stock to over $77 billion in less than six years",
    "description": "With a winning track record that dates back more than a half-century it's not a surprise that professional & everyday investors wait on pins & needles to see what the \"Oracle of Omaha\" has been buying & selling",
    "published_at": "2024-05-10T11:12:00Z",
    "content": "With a winning track record that dates back more than a half-century it’s not a surprise that professional & everyday investors wait on pins & needles to see what the “Oracle of Omaha” has been buying & selling Over the weekend, Omaha saw a gathering of approximately 40,000 investors for Berkshire Hathaway’s annual shareholder meeting, all eager to hear from Warren Buffett, dubbed the “Oracle of Omaha.” Buffett, who took over as CEO in the mid-1960s, has consistently outperformed Wall Street’s stock indexes. While the S&P 500 achieved a remarkable return of nearly 34,000% during his tenure, Buffett led Berkshire Hathaway’s Class A shares to an astonishing return of almost 4,900,000%. This unparalleled success has made investors eagerly anticipate Buffett’s insights on stocks, the U.S. economy, and investing philosophy. Despite the anticipation surrounding Buffett’s investment moves, his significant stock purchases are not revealed in the usual 13F filings. Over the past six quarters, Berkshire Hathaway has been notably more inclined to sell than buy, with a $56 billion difference between sales and purchases of equity securities from October 2022 to March 2024. This trend indicates Buffett’s and his team’s selective approach to buying investments, a strategy they’ve maintained for over a year. Despite this trend, one notable exception in Berkshire Hathaway’s investment strategy is Occidental Petroleum. Buffett has been consistently adding to Berkshire’s stake in Occidental over the past two years, considering it an “indefinite” holding. His affinity for Occidental stems from its role in supplying oil, a necessity for both the U.S. and global economies. Moreover, Occidental’s revenue primarily comes from its drilling segment, positioning it uniquely to benefit from sustained or rising crude oil prices. See Also: Scientists found a startling glitch in Einstein’s Theory of Relativity Beyond Occidental Petroleum’s fundamentals, macro factors also favor the company. Reduced capital investment from energy majors over the past three years, due to pandemic-related uncertainty, has led to a constrained global supply of oil. This shortage suggests that the demand for oil is unlikely to be oversupplied in the near future, further bolstering Occidental’s position in the market. Source: The Motley Fool \n\n              New 3.1 magnitude earthquake in Kefalonia            \n On Friday there were three other earthquakes of 3.9, 4.1 and 3.1 magnitude\r\n Read more → \n\n              Vravrona: The father admitted that he threw the baby in the trash            \n The images show the man holding two bags in his left hand, one of which contains the dead infant Read more → \n\n              Ministry of Culture: Fire protection works at the Minoan palace of Zominthos            \n The archaeological site is included in the nomination file for inscription on the UNESCO World Heritage List\r\n Read more →"
  },
  {
    "title": "‘It’s an obvious move’: Elon Musk says Warren Buffett should buy Tesla stock",
    "description": "Warren Buffett is one of the most closely watched investors in the world — and with good reason. From 1964 to 2023, he steered Berkshire Hathaway (BRK.B) to an astounding overall gain of 4,384,748%. Following Berkshire's recent annual shareholders meeting, th…",
    "published_at": "2024-05-10T11:00:12Z",
    "content": "\n        Warren Buffett is one of the most closely watched investors in the world — and with good reason. From 1964 to 2023, he steered Berkshire Hathaway (BRK.B) to an astounding overall gain of 4,384,748%.Following Berkshire's recent annual shareholders meeting, the internet is abuzz with discussions of Buffett's current investments and potential future moves.• None Commercial…\n     \n#warrenbuffett#followingberkshire#nonecommercial#walmartwholefoods#kroger#usfed#oracleofomaha#apple "
  },
  {
    "title": "A good monsoon, continuity of political setup and capex boom to keep us in good shape for next 12 months: Raamdeo Agrawal",
    "description": "Raamdeo Agrawal predicts BJP's Lok Sabha success, NDA gains, and current government continuity. Foreign investors sell billion daily due to election risk, causing market turbulence. Market bets on continuity for corporate earnings.",
    "published_at": "2024-05-10T10:53:52Z",
    "content": "India is a buy-on-dips market; we have raised a lot of cash unlike in ‘14 & ‘19 elections: Sandeep Tandon Waiting to buy the dip? Wait for further decline: Sunil Subramaniam Will Mr Market get it right this election also? Is nervousness about range of BJP victory justified? Download The Economic Times News App to get Daily Market Updates & Live Business News.  Subscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.  Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price Download The Economic Times News App to get Daily Market Updates & Live Business News.  Subscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.  Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price All Mutual Funds Top Tax Saving Mutual Funds Better Than Fixed Deposits Low Cost High Return Funds Best Hybrid Funds Best Large Cap Funds SIP’s starting Rs. 500 Top Performing Mid Caps Promising Multi Cap Funds Top Rated Funds Top Performing Index Funds Trending Now Hot on Web In Case you missed it Top Calculators Top Searched Companies Top Definitions Top Story Listing Top Slideshow Private Companies Top Commodities Top Prime Articles Top Videos Top Market Pages Follow us on: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin. Log In/Connect with: Will be displayed Will not be displayed Will be displayed Worry not. You’re just a step away. It seems like you're already an ETPrime member with Login using your ET Prime credentials to enjoy all member benefits Log out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.  To read full story, subscribe to ET Prime ₹34 per week \n                    Billed annually at \n                    ₹2499 ₹1749 Super Saver Sale - Flat 30% Off On ET Prime Membership Offer Exclusively For You Save up to Rs. 700/- ON ET PRIME MEMBERSHIP Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get Flat 40% Off Then  ₹ 1749 for 1 year Offer Exclusively For You ET Prime at ₹ 49 for 1 month Then  ₹ 1749 for 1 year Stay Ahead in the New Financial Year Get flat 20% off on ETPrime     90 Days Prime access worth Rs999 unlocked for you Exclusive Economic Times Stories, Editorials & Expert opinion across 20+ sectors Stock analysis. Market Research. Industry Trends on 4000+ Stocks ​Get 1 Year Complimentary Subscription of TOI+ worth Rs.799/-​ Stories you might be interested in"
  },
  {
    "title": "Elon Musk says Warren Buffett should buy Tesla stock — Berkshire already even owns a stake in its top competitor",
    "description": "Be greedy when others are fearful?",
    "published_at": "2024-05-10T10:50:00Z",
    "content": "Warren Buffett is one of the most closely watched investors in the world — and with good reason. From 1964 to 2023, he steered Berkshire Hathaway (BRK.B) to an astounding overall gain of 4,384,748%. Following Berkshire's recent annual shareholders meeting, the internet is abuzz with discussions of Buffett's current investments and potential future moves. Commercial real estate has beaten the stock market for 25 years — but only the super rich could buy in. Here's how even ordinary investors can become the landlord of Walmart, Whole Foods or Kroger Cost-of-living in America is still out of control — use these 3 'real assets' to protect your wealth today, no matter what the US Fed does or says These 5 magic money moves will boost you up America's net worth ladder in 2024 — and you can complete each step within minutes. Here's how On X, one user made a daring proposition to the Oracle of Omaha, stating, “c'mon Warren Buffett, sell all your $AAPL and buy $TSLA.” Given that Apple is currently Berkshire's largest holding, it’s a bold suggestion. The post also caught the attention of Tesla CEO Elon Musk, who replied, “He should take a position in Tesla. It’s an obvious move.” Tesla is one of the most volatile names in the market. While shares are down nearly 30% year to date, they’re up a whopping 992% over the last five years. Buffett hasn’t invested in Tesla, but he holds Musk in high regard. He called him “a brilliant, brilliant guy” at Berkshire’s annual shareholders meeting in 2023. Buffett also noted, “We don't want to compete with Elon in a lot of things.” Buffett’s late right-hand man, Charlie Munger, concurred. “We don’t want that much failure,” he said. Still, in a post on X last year, Musk revealed that Munger had the chance to invest in Tesla but chose not to, potentially missing out on substantial profits. “Munger could’ve invested in Tesla at ~$200M valuation when I had lunch with him in late 2008,” he wrote. To put things in perspective, Tesla now commands a market cap of over $540 billion. Read more: Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024 To be sure, Buffett hasn't entirely sidestepped the EV race. Chinese EV manufacturer BYD has been a part of investing legend Warren Buffett's portfolio for more than a decade. In 2008, Berkshire Hathaway acquired 225 million shares of BYD for $232 million, a move that proved to be highly lucrative. By the end of 2020, as stated in Berkshire’s shareholder letter, their stake was valued at approximately $5.9 billion. Although Buffett later began reducing his stake in BYD, an October 2023 stock exchange filing reported on by Reuters revealed that Berkshire still held a sizable 7.98% stake in the company. In the fourth quarter of 2023, BYD’s EV sales reached 526,409 vehicles, overtaking Tesla's deliveries of 484,507 EVs, according to Reuters, and displacing it as the top EV manufacturer globally. Musk has acknowledged the competitive threat posed by Chinese automakers. In January, he said that without trade barriers, Chinese car companies “will pretty much demolish most other companies in the world.” In this year’s Berkshire shareholders meeting, Buffett did comment on Tesla, but it was in response to a question on how Tesla’s autonomous driving technology might reduce accidents, potentially affecting the business of Geico, an auto insurance company owned by Berkshire. “If accidents get reduced by 50%, it's going to be good for society and it's going to be bad for insurance companies' volume. But good for society is what we're looking for,” Buffett said. Ajit Jain, vice chairman of insurance operations at Berkshire Hathaway, added that while the number of accidents might decrease as a result of autonomous driving technology, the repair cost per accident could be substantially higher. “If you multiply the number of accidents times the cost of each accident, I'm not sure that total number has come down as much as Tesla would like us to believe,” he explained. Jain also remarked on Tesla’s own ventures into the insurance industry. “Tesla has been toying with the idea of writing insurance directly or indirectly, and so far it hasn’t really been much of a success.” Car insurance premiums in America are through the roof — and only getting worse. But 5 minutes could have you paying as little as $29/month Jeff Bezos, Mark Zuckerberg, and Jamie Dimon are selling out of US stocks in a big way — here's how to diversify into private real estate within minutes 'It's not taxed at all': Warren Buffett shares the 'best investment' you can make when battling rising costs — take advantage today This article provides information only and should not be construed as advice. It is provided without warranty of any kind. Sign in to create a watchlist"
  },
  {
    "title": "‘It’s an obvious move’: Elon Musk says Warren Buffett should buy Tesla stock — Berkshire already even owns a stake in its top competitor",
    "description": "Be greedy when others are fearful?",
    "published_at": "2024-05-10T10:50:00Z",
    "content": "For premium support please call: Warren Buffett is one of the most closely watched investors in the world — and with good reason. From 1964 to 2023, he steered Berkshire Hathaway (BRK.B) to an astounding overall gain of 4,384,748%. Following Berkshire's recent annual shareholders meeting, the internet is abuzz with discussions of Buffett's current investments and potential future moves. Commercial real estate has beaten the stock market for 25 years — but only the super rich could buy in. Here's how even ordinary investors can become the landlord of Walmart, Whole Foods or Kroger Cost-of-living in America is still out of control — use these 3 'real assets' to protect your wealth today, no matter what the US Fed does or says These 5 magic money moves will boost you up America's net worth ladder in 2024 — and you can complete each step within minutes. Here's how On X, one user made a daring proposition to the Oracle of Omaha, stating, “c'mon Warren Buffett, sell all your $AAPL and buy $TSLA.” Given that Apple is currently Berkshire's largest holding, it’s a bold suggestion. The post also caught the attention of Tesla CEO Elon Musk, who replied, “He should take a position in Tesla. It’s an obvious move.” Tesla is one of the most volatile names in the market. While shares are down nearly 30% year to date, they’re up a whopping 992% over the last five years. Buffett hasn’t invested in Tesla, but he holds Musk in high regard. He called him “a brilliant, brilliant guy” at Berkshire’s annual shareholders meeting in 2023. Buffett also noted, “We don't want to compete with Elon in a lot of things.” Buffett’s late right-hand man, Charlie Munger, concurred. “We don’t want that much failure,” he said. Still, in a post on X last year, Musk revealed that Munger had the chance to invest in Tesla but chose not to, potentially missing out on substantial profits. “Munger could’ve invested in Tesla at ~$200M valuation when I had lunch with him in late 2008,” he wrote. To put things in perspective, Tesla now commands a market cap of over $540 billion. Read more: Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024 To be sure, Buffett hasn't entirely sidestepped the EV race. Chinese EV manufacturer BYD has been a part of investing legend Warren Buffett's portfolio for more than a decade. In 2008, Berkshire Hathaway acquired 225 million shares of BYD for $232 million, a move that proved to be highly lucrative. By the end of 2020, as stated in Berkshire’s shareholder letter, their stake was valued at approximately $5.9 billion. Although Buffett later began reducing his stake in BYD, an October 2023 stock exchange filing reported on by Reuters revealed that Berkshire still held a sizable 7.98% stake in the company. In the fourth quarter of 2023, BYD’s EV sales reached 526,409 vehicles, overtaking Tesla's deliveries of 484,507 EVs, according to Reuters, and displacing it as the top EV manufacturer globally. Musk has acknowledged the competitive threat posed by Chinese automakers. In January, he said that without trade barriers, Chinese car companies “will pretty much demolish most other companies in the world.” In this year’s Berkshire shareholders meeting, Buffett did comment on Tesla, but it was in response to a question on how Tesla’s autonomous driving technology might reduce accidents, potentially affecting the business of Geico, an auto insurance company owned by Berkshire. “If accidents get reduced by 50%, it's going to be good for society and it's going to be bad for insurance companies' volume. But good for society is what we're looking for,” Buffett said. Ajit Jain, vice chairman of insurance operations at Berkshire Hathaway, added that while the number of accidents might decrease as a result of autonomous driving technology, the repair cost per accident could be substantially higher. “If you multiply the number of accidents times the cost of each accident, I'm not sure that total number has come down as much as Tesla would like us to believe,” he explained. Jain also remarked on Tesla’s own ventures into the insurance industry. “Tesla has been toying with the idea of writing insurance directly or indirectly, and so far it hasn’t really been much of a success.” Car insurance premiums in America are through the roof — and only getting worse. But 5 minutes could have you paying as little as $29/month Jeff Bezos, Mark Zuckerberg, and Jamie Dimon are selling out of US stocks in a big way — here's how to diversify into private real estate within minutes 'It's not taxed at all': Warren Buffett shares the 'best investment' you can make when battling rising costs — take advantage today This article provides information only and should not be construed as advice. It is provided without warranty of any kind. Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement"
  },
  {
    "title": "100 Years of IBM",
    "description": "Tikalon LLC, Scientific Consulting and Intellectual Property Creation.  Includes links to interesting scientific, mathematics, computer and technical web sites.",
    "published_at": "2024-05-10T10:25:24Z",
    "content": null
  },
  {
    "title": "Warren Buffett's Latest $2.6 Billion Buy Brings His Total Investment in This Stock to More Than $77 Billion in Under 6 Years",
    "description": "Last weekend, in the neighborhood of 40,000 investors flocked to Omaha for Berkshire Hathaway's (NYSE: BRK.A)(NYSE: BRK.B) annual shareholder meeting. The lure was simple: to hear the \"Oracle of Omaha,\" Warren Buffett, speak about stocks, the U.S. economy, an…",
    "published_at": "2024-05-10T09:32:06Z",
    "content": "\n        Last weekend, in the neighborhood of 40,000 investors flocked to Omaha for Berkshire Hathaway's (NYSE: BRK.A)(NYSE: BRK.B) annual shareholder meeting. The lure was simple: to hear the \"Oracle of Omaha,\" Warren Buffett, speak about stocks, the U.S. economy, and his investing philosophy for hours on end.Since taking over as the CEO of Berkshire Hathaway in the mid-1960s,…\n     \n#omaha#warrenbuffett#berkshirehathaway#tedweschler#toddcombs#occidentalpetroleum#oxy#occidental "
  },
  {
    "title": "Markkinaviikko | Nokian potku-uhka, Olkiluodon huoltoviive ja Nesteen johtaja­ruletti – HS kertaa viikon tärkeimmät talous­uutiset",
    "description": "HS:n markkinaviikko kertaa yhdessä jutussa viikon tärkeimmät talous­uutiset.",
    "published_at": "2024-05-10T09:00:00Z",
    "content": "Toimituksen valinnat täydennettynä sinulle suositellulla sisällöllä. Lue lisää HS:n markkinaviikko kertaa yhdessä jutussa viikon tärkeimmät talous­uutiset. Sijoittajalegenda. Berkshire Hathawayn yhtiökokouksessa Yhdysvaltain Omahassa oli 3. toukokuuta esillä pehmohahmoja sijoittaja Warren Buffettista ja hänen pitkäaikaisesta yhtiökumppanistaan Charlie Mungerista. Kuva: Scott Morgan / Reuters Verkkolaitteita valmistava Nokia valmistautuu uusiin työpaikkojen vähennyksiin Suomessa, kertovat asiasta perillä olevat lähteet. Suunnitelmissa on karsia Suomesta enimmillään satoja työpaikkoja. Määrä täsmentyy lähiaikoina. Näillä näkymin Nokia harkitsee aloittavansa muutosneuvottelut Suomessa joko kesällä tai syksyllä, mutta päätöstä ajankohdasta ei ole vielä tehty. Kannattavuutensa turvaamiseksi Nokia ilmoitti lokakuussa uusista kululeikkauksista. Se aikoo karsia kustannuksiaan 800–1 200 miljoonaa euroa vuoden 2026 loppuun mennessä. Leikkaukset merkitsevät 9 000–14 000 työpaikan vähennyksiä eri puolilla maailmaa. Koronaviruspandemian 50 ”voittajayhtiötä” on menettänyt markkina-arvostaan ​​noin 1 500 miljardia dollaria vuoden 2020 lopun jälkeen, kertoo sanomalehti Financial Times (FT). Monet sijoittajat ovat kääntäneet selkänsä osakkeille, jotka kallistuivat erittäin voimakkaasti pandemian aikana määrättyjen rajoitusten aikana. Tutkimusyhtiö S&P Globalin mukaan teknologiayhtiöt hallitsevat niiden 50 yrityksen joukkoa, joiden markkina-arvo on yli kymmenen miljardia dollaria. Monilla näistä yhtiöistä osake kohosi prosentuaalisesti eniten vuonna 2020. FT:n mukaan yksi eniten markkina-arvoaan menettäneistä oli ohjelmistoyhtiö Zoom, joka tunnetaan videoneuvottelupalveluistaan. Sen osake kallistui 765 prosenttia vuonna 2020, jolloin etätyö lisääntyi voimakkaasti. Yhtiön osake on sittemmin halventunut 80 prosenttia, mikä vastaa runsaan 77 miljardin dollarin markkina-arvon supistumista saman vuoden lopusta. Kiinalainen Bytedance ja sen Tiktok-videopalvelu ovat haastaneet Yhdysvaltain hallinnon oikeuteen. Yhtiöiden tarkoituksena on oikeusjutulla estää laki, joka kieltää Tiktok-sovelluksen Yhdysvalloissa, jos Bytedance ei myy toimintojaan maassa. Yhtiöt jättivät kanteensa Yhdysvaltain valitustuomioistuimeen tiistaina. Tiktok-laki meni läpi Yhdysvaltain kongressissa huhtikuun lopussa. Lain mukaan Bytedancellä on aikaa myydä Tiktokin toiminnot Yhdysvalloissa ensi vuoden tammikuun 19. päivään asti. Jos näin ei tapahdu, Tiktok-sovellus suljetaan Applen ja Googlen sovelluskauppojen ulkopuolelle Yhdysvalloissa. Teräsyhtiö Outokummun oikaistu liiketulos sukelsi tammi–maaliskuussa 17 miljoonaa euroa miinukselle. Vuotta aiemmin vastaavana aikana se oli ollut 144 miljoonaa euroa plussalla. Liikevaihto laski tammi–maalikuussa noin 1,5 miljardiin euroon, kun se vuotta aiemmin oli ollut noin kaksi miljardia euroa. Oikaistu käyttökate laski yli 200 miljoonasta eurosta 38 miljoonaan euroon. Suurin osa yhtiön Tornion-toiminnoista oli suljettuina neljän viikon ajan poliittisten lakkojen vuoksi. Outokumpu antoi maaliskuussa lakkojen vuoksi kaksi negatiivista tulosvaroitusta. Olkiluodon kolmannen ydinvoimayksikön vuosihuolto venyy ainakin tiistaihin 14. toukokuuta. ”Olkiluoto 3:n ensimmäistä kertaa toteutettavat vuosihuollot pitenevät vielä neljällä päivällä turbiini-generaattorin lisätutkimuksien vuoksi luotettavan käytön varmistamiseksi. Nyt päivitetyn aikataulun mukaan huollot saadaan päätökseen 14. toukokuuta”, yhtiö kirjoitti X:ssä keskiviikkona. OL3:n vuosihuollon valmistumisen takarajaa on siirretty huhti–toukokuun aikana useasti. Vuosihuolto alkoi 2. maaliskuuta, ja sen oli tarkoitus valmistua jo 8. huhtikuuta. Edellisen kerran TVO siirsi huollon valmistumisen takarajaa vappuaattona, kun se kertoi, että Olkiluodon 3:n vuosihuolto valmistuu 10. toukokuuta. Tuolloin huollon takarajaa siirrettiin kahdella päivällä. Yhdysvaltain viime vuoden lopulla asettamat pakotteet ulkomaisille pankeille ovat vaikeuttaneet huomattavasti Venäjän rahaliikennettä, uutisoi talouslehti Financial Times. Yhdysvaltain joulukuussa asettamia niin sanottuja toissijaisia pakotteita kohdistetaan pankkeihin, jotka rahoittavat Venäjän sodankäynnille tärkeiden laitteiden hankintaa. Pakotteita on pyritty kohdistamaan pankkeihin niissä maissa, joiden kaupankäynti Venäjän kanssa on kasvanut merkittävästi sen jälkeen, kun hyökkäyssota Ukrainaan alkoi. FT:n haastattelemien asiantuntijoiden ja virkamiesten mukaan sotaan liittyvän viennin jyrkkä lasku johtuu siitä, että pankit pelkäävät mahdollisia pakotteista seuraavia sanktioita. Yhdysvallat voi esimerkiksi sulkea pankit ulos dollariin nojaavasta kansainvälisestä rahoitusjärjestelmästä, jos ne toimivat sodankäynnin kanssa tekemisissä olevien yritysten kanssa. Yhdysvaltalainen sijoittajalegenda, Berkshire Hathaway -sijoitusyhtiön hallituksen puheenjohtaja ja suuromistaja Warren Buffett vakuutteli viime viikonloppuna järjestetyssä yhtiökokouksessa, että hänen seuraajansa ovat valmiita luotsaamaan yhtiötä siinä vaiheessa, kun hänen on aika siirtyä sivuun. Matkapuhelimistaan tunnettu teknologiayhtiö Apple sai yhtiökokousviikonloppuna Buffettilta vuolaasti kehuja siitäkin huolimatta, että Berkshire Hathaway on keventänyt omistusosuuttaan Applesta huomattavasti viime vuodesta. Osin Applen osakkeiden myynnin ansiosta Berkshire Hathawayn käteisvarat ovat ennätyssuuret ja saattavat Buffettin mukaan tällä vuosineljänneksellä ylittää jopa 200 miljardin dollarin rajapyykin. Buffettin mukaan yhtiö olisi valmis sijoittamaan varat, mikäli vastaan tulisi sopiva sijoituskohde. Kaivosteknologiayhtiö Metso aloittaa muutosneuvottelut, jotka voivat johtaa enintään 90 työtehtävän vähentämiseen Suomessa. Maailmanlaajuisesti tehtäviä voidaan vähentää arviolta noin 240. Suunnitelmaan sisältyy myös lomautuksia. Metso suunnittelee uudistavansa Mineraalit-liiketoimintaansa. Suunnitellut uudistukset liittyvät markkinaympäristön muutoksiin esimerkiksi energiamurrosta tukevien strategisten mineraalien merkityksen kasvun vuoksi. Muutokset polttoainevalmistaja Nesteen ylimmässä johdossa jatkuvat. Neste kertoi keskiviikkona, että yhtiön uusiutuvien tuotteiden liiketoiminnan johtaja Katja Wodjereck jättää tehtävänsä välittömästi. Neste muodosti Wodjereckin johtaman liiketoimintayksikön marraskuussa, ja hän työskenteli Nesteessä vain runsaan vuoden. Nesteen uusiutuvat tuotteet -liiketoiminnasta vastuun on ottanut väliaikaisesti Carl Nyberg. Uusiutuvat tuotteet on Nesteen toiseksi suurin liiketoiminta-alue perinteisten öljytuotteiden jälkeen, mutta sitä pidetään tärkeämpänä yhtiön tulevaisuudelle."
  },
  {
    "title": "Eventos extremos preocupam setor",
    "description": "Comercializadoras, geradoras, transmissoras e distribuidoras tentam entender o “novo anormal” do clima para aumentar a resiliência e mitigar impactos causados por ondas de calor, secas e tempestades",
    "published_at": "2024-05-10T08:11:30Z",
    "content": "  10/05/2024 05h11    Atualizado  10/05/2024       Na primeira semana de novembro de 2023, uma tempestade atingiu a região metropolitana de São Paulo. Com ventos superiores a 100 km/h, deixou 3,7 milhões de consumidores sem luz. Passadas 24 horas, mais de dois milhões de pessoas continuavam no escuro. No início do ano, novas chuvas levaram a capital paulista a enfrentar problemas no abastecimento, atingindo a região central, o que levou o ministro de Minas e Energia, Alexandre Silveira, a analisar o que poderia ser feito em relação à concessionária Enel.   No início de março, em sua tradicional carta aos investidores, o megainvestidor Warren Buffet alertou que o conglomerado Berkshire Hathaway seria cauteloso em colocar dinheiro novo na PacifiCorp, concessionária dos Estados Unidos que atua em seis Estados do país, como Oregon e Califórnia. A gigante está sendo processada pelo governo dos Estados Unidos e consumidores em razão de incêndios em 2020 que destruíram milhares de casas e queimaram mais de 200 mil hectares de terras no Oregon. As vítimas do incêndio pediram mais de US$ 7 bilhões em indenizações, alegando que a concessionária não atuou como deveria para controlar o fogo.   Esses são dois exemplos do cenário que tem levado as mudanças climáticas a ganhar ainda mais relevância no setor elétrico. “Desde a crise hídrica, o tema tem feito comercializadoras, geradoras, transmissoras e distribuidoras buscarem entender mais e compreender se os eventos climáticos extremos serão mais recorrentes e qual seria essa nova recorrência. Temos tido transmissoras que enfrentaram uma queda de torre por ano nos últimos quatro anos e isso não ocorria com essa frequência”, afirma Ana Clara Marques, especialista em clima na Climatempo Energia.   Em 2023, registraram-se na cidade de São Paulo 107 dias com temperatura superior a 30 graus Celsius, acima da média de 82 dias apurada desde 2007, e nove dias com mais de 35 graus, o triplo da média em 16 anos, segundo dados da Climatempo. “Entender os novos padrões é essencial para saber como as empresas precisarão adaptar a operação e seus equipamentos”, diz a meteorologista. Se ventos superiores a 100 km/h se tornam mais frequentes, temperaturas mais elevadas por mais dias podem ter mais impacto sobre o consumo e raios podem aumentar a incidência de incêndios ao redor de linhas de transmissão, será preciso pensar em equipamentos mais resilientes e planejar novos traçados de linhas de transmissão.   A ISA CTEEP contratou a Way Carbon para analisar os efeitos climáticos sobre sua área de concessão até 2050. Responsável por 94% da energia transmitida no Estado de São Paulo, a concessionária pretende mapear as áreas mais sensíveis, entender os potenciais impactos e discutir como se pode criar uma regulação para tratar da resiliência climática. “Temos de entender se pode haver uma reconfiguração do traçado das linhas ou se é preciso ter algum reforço não previsto”, diz o presidente da empresa, Rui Chammas. Atenta aos impactos das mudanças climáticas, a Agência Nacional de Energia Elétrica (Aneel) abriu uma tomada de subsídios sobre a resiliência das redes e os efeitos climáticos (encerrada em abril).   “Os efeitos adversos das mudanças climáticas demandam ativos e redes mais resilientes. O ‘novo anormal’ climático já chegou. Os eventos climáticos extremos que o país sofreu em 2023, como a seca extrema na Amazônia, temperaturas recordes, vendavais na região de São Paulo e inundações na região Sul, não são um ‘soluço’, causado, por exemplo, por um El Niño severo, e sim o ‘novo anormal’ climático. Esta é uma constatação factual do World Weather Attribution, uma colaboração acadêmica global que estuda a atribuição de eventos extremos, cálculos do impacto das mudanças climáticas em eventos meteorológicos extremos, como ondas de calor, secas e tempestades”, observa o presidente da PSR, Luiz Augusto Barroso.   Ele destaca que essa nova realidade climática tem duas consequências para o setor elétrico. A primeira: além dos investimentos em mitigações, há a necessidade de investimentos em adaptação e resiliência. A segunda: os modelos matemáticos de afluência, ventos, temperatura etc. e os critérios de planejamento e operação precisam ser adaptados imediatamente para a nova realidade.   “O desafio é que a decisão sobre a melhor proporção entre ações estruturais, corretivas e de recomposição depende da frequência dos eventos desfavoráveis. Por exemplo, secas ou vendavais. No entanto, o efeito das mudanças climáticas é justamente alterar essas frequências. Por exemplo, a seca de 2020 e 2021 foi equivalente à pior estiagem observada nos últimos 90 anos. Se devido às mudanças climáticas, secas como essa passarem a ocorrer com um intervalo médio de, por exemplo, 15 anos, os modelos de afluências e os critérios de planejamento devem se ajustar à nova realidade. Caso contrário, seremos ‘otimistas’ e causaremos prejuízos aos consumidores”, aponta Barroso.   A nova realidade cria dilemas: mitigar os impactos climáticos implica modernizar e tornar resilientes redes de distribuição e transmissão, sendo que parte delas tem mais de 30 anos. O desafio é fazer esse esforço caber no bolso. Hoje, 12,5% da conta de luz, segundo dados do governo, são subsídios e encargos. Um levantamento da Associação Brasileira de Grandes Consumidores Industriais de Energia e de Consumidores Livres (Abrace) apontou que em 2022 o Brasil teve o maior custo residencial com energia elétrica na comparação com 34 países da Organização para a Cooperação e Desenvolvimento Econômico (OCDE). A carga tributária em energia, que acaba no bolso de Estados e União, supera 30%.   Na área de transmissão, estimativas do governo apontam que até 2032 deveriam ser investidos R$ 37,6 bilhões em atualizações. Boa parte das linhas de transmissão que escoam a energia nas regiões Sudeste e Sul tem mais de 50 anos de idade. Levantamento do Operador Nacional do Sistema Elétrico (ONS) apontou que existiriam 96.740 equipamentos com vida útil regulatória até 2022. Isso não implica que eles precisariam ser imediatamente substituídos até 2022, mas que os equipamentos ficariam completamente depreciados a partir da data. Estariam em substituição cerca de 15% do total, pouco mais de 16 mil equipamentos, mas não há informações precisas sobre a questão.   “Será importante não onerar as tarifas desnecessariamente, para que os consumidores, já muito sacrificados, possam absorver os custos necessários de investimentos em adaptação e resiliência. Isso significa que o planejamento, através de análises de custo-benefício entre as opções tecnológicas, deve evitar que o consumidor pague pelo que não precisa e buscar que se pague o menos possível por aquilo que precisa, e onde há valor para o sistema”, afirma Barroso.   O impacto será também sobre a comercialização de energia e a gestão de risco, uma vez que extremos aumentam as vazões e podem ter interferência sobre regime de ventos ou sobre a irradiação. “Elas também precisarão se adaptar. Se vamos ter mais conservadorismo, isso vai depender da frequência, magnitude e direção dos impactos e da capacidade dos agentes e do sistema gerenciarem o novo perfil de risco. Por exemplo, maior volatilidade de preços cria oportunidades na comercialização, mais riscos e mais responsabilidade para o sistema, que precisará criar mecanismos para garantir a segurança de mercado”, diz Barroso.   Efeitos climáticos mais extremos também têm impacto sobre o consumo. De 2007 a 2023, o ano passado só perdeu para 2014 no registro de temperaturas acima de 30 graus: na cidade de São Paulo, em 2014, 120 dias ficaram acima de 30 graus e 11 acima de 35, enquanto em 2023 foram, respectivamente, 107 e 9 dias. O maior consumo no setor tem sido verificado à tarde, em razão do acionamento de ar-condicionado. Em 15 de março, em uma onda de calor, o ONS registrou a maior demanda instantânea da história: naquele dia, às 14h37, o patamar atingido foi de 102.478 MW. “Temos buscado estudar mais os fenômenos climáticos para nos preparar melhor, com interação maior com a Agência Nacional de Águas e com meteorologistas. A temperatura tem sido variável importante na demanda”, diz o diretor-geral do ONS, Luiz Carlos Ciocchi.   Esse impacto das mudanças climáticas coincide com o avanço de fontes variáveis, como usinas solares e eólicas, e a maior complexidade da operação. Torna ainda mais relevante um sistema de precificação que capture a variabilidade das fontes, a gestão de demanda de consumidores e a maior flexibilidade na operação. Quando o sol para de brilhar no céu, no fim da tarde, se verifica a queda da geração solar e um aumento da carga, já que os mais de dois milhões de instalações de geração distribuída solar deixam de gerar energia e passam a consumir da rede.   No jargão do setor, se assiste a uma rampa, como se milhões de aparelhos de ar-condicionado e chuveiros fossem ligados ao mesmo tempo. Essa rampa hoje está em 25 GW de capacidade. Estima-se que possa chegar a 50 GW em 2027, segundo projeções do ONS. Isso tem influenciado, em dias de calor, aumento de preços da energia no mercado livre no fim da tarde e à noite. “Flexibilidade passa a ser ainda mais importante”, diz Ciocchi.   Siga nosso canal e receba as notícias mais importantes do dia!  Conhecer      Com maior bancada, apoio do partido pode ser decisivo na sucessão da presidência das Casas do Legislativo, em fevereiro de 2025 Acompanhe as informações atualizadas sobre as possibilidades de doação (dinheiro, produtos) e veja iniciativas de empresas e organizações para ajudar os gaúchos Fortes chuvas na região provocaram centenas de mortes e causaram destruição em todo o Estado Segundo a re.green, empresa que tem Arminio Fraga e João Moreira Salles entre os acionistas, objetivo é entregar cerca de 3 milhões de toneladas de créditos de carbono a partir da restauração de áreas da Mata Atlântica Segundo a Agência Nacional de Águas (ANA), a altura das águas ficou em 4,58 metros, seguindo a tendência de queda sentida nas últimas 24h De acordo com dados da Anatal, há 344 cidades no Estado com funcionamento pleno dos sistemas de telecomunicações Conselheiro do TCE está preso desde o fim de março por suspeita de participação no assassinato de Marielle Franco e Anderson Gomes Lugares como Bergen, na Noruega, e Innsbruck, na Áustria, têm sido particularmente procurados Treinamento ocorre dez dias antes da posse no novo presidente, Lai Ching-te Cidade concentra cerca de 1,5 milhões de gazenses – mais da metade da população de 2,3 milhões de toda a faixa antes da guerra"
  },
  {
    "title": "Así es el plan de sucesión del Oráculo de Omaha",
    "description": "A sus 93 años, Warren Buffett, el presidente de Berkshire Hathaway, no tiene pensado retirarse, aunque es consciente de que debe pasar el relevo a Greg Abel, que también recibirá potestad para decidir sobre las inversiones del holding.",
    "published_at": "2024-05-10T08:00:00Z",
    "content": " Dolar: $926,78 | UF: $37.318,64 Indicadores Papel Digital Registro newsletter  papel digital Compartir \"Espero volver a estar aquí el año que viene\". Así se despidió Warren Buffett de los inversionistas que el fin de semana pasado asistieron en Omaha (Nebraska) a la asamblea anual de Berkshire Hathaway, la primera que se celebra sin Charlie Munger, impulsor de esta cita en la que cada año acompañaba al oráculo de Omaha en el estrado para contestar a las preguntas de sus accionistas. No han faltado sentidos homenajes a quien fuera vicepresidente del grupo y mano derecha de Buffett durante casi cinco décadas, aunque eso no ha evitado que se echaran de menos sus frases lapidarias: \"Las criptomonedas son venenos para ratas y un peligro para la civilización\". Warren Buffett obvió en esta edición el mundo cripto, pero sí se paró a valorar el potencial de la inteligencia artificial. Reconoció que no sabe gran cosa al respecto, pero sí tiene clara una cosa: las estafas a través de esta tecnología podrían convertirse en la próxima \"industria de mayor crecimiento\". Incluso llegó a comparar su potencial transformador con el que en su día tuvieron las armas nucleares. \"Si estuviera interesado en invertir en estafas, la IA va a ser la industria de crecimiento de todos los tiempos\", aseguró. En su opinión, no hay límite cuando existe una tecnología capaz de crear una imagen de algo que no ha ocurrido con total perfección. ¿Se puede controlar a través de leyes o códigos éticos? Su diagnóstico fue contundente: \"No conozco ninguna forma de volver a meter al genio en la botella\".   Arthur Mensch, la esperanza europea en la batalla por la IA Y aunque la IA es el tema de moda en Wall Street, en la junta de Berkshire Hathaway apenas ocupó unos pocos minutos. Lo que realmente centró la atención en esta edición fue la sucesión al frente del conglomerado. Buffett no tuvo problemas a la hora de abordar el tema entre bromas, pero se puso muy serio cuando aseguró que todo está organizado, aunque a sus 93 años piensa seguir al frente del negocio todo el tiempo que pueda. Greg Abel, que ostenta el cargo de vicepresidente de la compañía (excluyendo el negocio asegurador, que depende de Ajit Jain), no se separó de su lado en todo el fin de semana. En las ediciones anteriores, aparecía brevemente en escena, pero siempre se retiraba discretamente para ceder todo el protagonismo a sus dos jefes. Este año, no solo se ha situado junto a Buffett durante las largas horas que dura su comparecencia ante los inversionistas -en sesión doble de mañana y tarde-, sino que ha intervenido en varias ocasiones. Aun así, su momento cumbre llegó de la mano del presidente, que anunció que Abel no solo será el capitán de Berkshire Hathaway cuando él se retire, sino que también será el encargado de decidir sobre las inversiones que haga el holding, algo que hasta ahora no estaba claro. Solo habrá un sucesor, será Greg Abel y tendrá los mismos poderes que ahora tiene Buffett al frente de la compañía. Insistió en que no hace falta que nadie le recuerde su edad. Y bromeó haciendo hincapié en que \"algo sé de tablas actuariales\", en referencia a las estadísticas que utilizan las aseguradoras para calcular los seguros de vida. No en vano, el brazo asegurador de Berkshire Hathaway es uno de los principales negocios del holding, y uno de los que mejor se han comportado en el primer trimestre de este año, duplicando su beneficio antes de impuestos. En la junta, hubo tiempo para todo, aunque el punto de salida fue la presentación de los resultados del primer trimestre a primera hora del sábado. Las cuentas reflejaron un aumento del beneficio operativo del 39%, hasta los US$ 11.200 millones. Aun así, la atención de los accionistas se centró en la decisión de Berkshire Hathaway de reducir su participación en Apple, compañía que hasta ahora había sido una de las grandes apuestas personales de Warren Buffett. El Oráculo de Omaha dejó claro que la venta se debía exclusivamente a motivos fiscales para hacer frente a un incremento de la factura con Hacienda por el aumento de sus beneficios. \"Espero que no les importe\", bromeó Buffett, recordando lo patriótico que es pagar impuestos. Insistió en que sigue confiando en la compañía. Pese a haberse desprendido de alrededor del 13% de las acciones que tenía de Apple, todavía conserva alrededor de 790 millones de títulos del gigante tecnológico, valorados en más de US$ 135.000 millones. Desde Wall Street: banqueros anticipan cómo viene el mercado de deuda para Chile El empresario canadiense de 61, se graduó en 1984 de la Universidad de Alberta. Trabajó en PwC y en la empresa de energía CalEnergy. Luego se unió a Berkshire Hathaway Energy, entonces conocida como MidAmerican Energy en 1992, de la que Berkshire se hizo cargo en 1999 y se convirtió en jefe de esa firma en 2008. Desde 2018, Abel es consejero del holding de Buffett, así como vicepresidente de operaciones no aseguradas del grupo. Ahora supervisa las operaciones no relacionadas con los seguros de Berkshire, como BNSF, Berkshire Hathaway Energy y docenas de operaciones químicas, industriales y minoristas. En numerosas ocasiones, Charlie Munger –vicepresidente de la compañía y amigo de Buffett, quien falleció el año pasado a los 99 años – demostró que Greg Abel era su opción en la pugna por la sucesión de Berkshire Hathaway. Aunque Buffett quería que su inseparable compañero le sucediera, este siempre prefirió que fuera alguien más joven. Se prevé que cuando Buffett deje el cargo, su hijo mayor, Howard pase a ser el presidente no ejecutivo, para ayudar a preservar la cultura de Berkshire. Se estima que Todd Combs de 53 años y Ted Weschler de 61, que supervisan algunas de las inversiones en Bolsa de Berkshire, tomen una posición más relevante en el conglomerado. Expertos estiman que Greg Abel mantendrá los principios de asignación de capital que Berkshire tiene actualmente. “Siempre consideramos las acciones como si estuviéramos invirtiendo en un negocio, 1% o 100%”, ha dicho. Edificio Fundadores, Badajoz Nº 45,piso 10. Las CondesSuscripciones/Servicio al cliente: Celular: +56 9 71386534 Fijo: +56 2 23391047 - servicioalcliente@df.cl. - Horario de atención de lunes a jueves de 8:00 a 18:00 hrs. y viernes de 8:00 a 17:00 hrs.Venta Suscripciones: +56 9 4972  4317  -suscripciones@df.cl - Formulario de contacto aquíVenta publicitaria: 56 - 2 - 23391000 - ventas@df.clMesa central: 56 - 2 - 23391000 "
  },
  {
    "title": "Co z Berkshire Hathaway po śmierci Warrena Buffetta? Wyrocznia z Omaha po raz pierwszy udzieliła dokładnej odpowiedzi",
    "description": "W USA odbyło się doroczne zgromadzenie \nakcjonariuszy Berkshire Hathaway. Warren Buffet pierwszy raz udzielił \ndokładnej odpowiedzi na pytanie o zarządzanie spółką po jego śmierci. \nTen temat oraz kwestię wyboru zawodu po maturze szczególnie poleca \nsłuchaczo…",
    "published_at": "2024-05-10T07:53:51Z",
    "content": "W USA odbyło się doroczne zgromadzenie \nakcjonariuszy Berkshire Hathaway. Warren Buffet pierwszy raz udzielił dokładnej odpowiedzi na pytanie o zarządzanie spółką po jego śmierci. Ten temat oraz kwestię wyboru zawodu po maturze szczególnie poleca słuchaczom weekendowego podcastu pt.: \nBankomat redaktor naczelny \nAndrzej Stec. Podcast powstaje we współpracy Bankier.pl ze Związkiem Banków \nPolskich. W ciągu ok. 15 minut Związek Banków Polskich przedstawi \nnajważniejsze wydarzenia z życia gospodarczego w kraju i na świecie \nminionego tygodnia, a redaktor naczelny Bankier.pl, Andrzej Stec - dwie,\n najchętniej czytane publikacje z portalu. W tym tygodniu to następujące\n tematy: \n \nPodcast trafia za pośrednictwem strony ZBP do ok. 50 lokalnych rozgłośni\n radiowych. Zamieszczamy go również na stronie Bankier.pl. Miłego \nsłuchania! Bezpieczna metoda oszczędzania. Zyskaj do 5,25% w skali roku! Oblicz Zysk>> Rosyjscy hakerzy przejęli sygnał stacji TV i pokazali paradę zwycięstwa w Moskwie AstraZeneca wycofuje szczepionkę przeciw COVID-19 Minister finansów o inflacji. Tyle ma wynieść pod koniec roku Orban: Potrzebujemy chińskich policjantów z powodu napływu turystów z Chin Glapiński: W najbliższych kwartałach inflacja może wzrosnąć, raczej na pewno wzrośnie Korzystanie z portalu oznacza akceptację regulaminu"
  },
  {
    "title": "2024 Berkshire Hathaway Annual Shareholder Meeting Video, Transcript, and Notes",
    "description": "The 2024 Berkshire Hathaway Annual Shareholder Meeting occurred on May 4th, 2024, and while there are lots of articles offering highlights (including this one), it’s never the same feeling as tuning into the actual thing. I always find a few nuggets that mean…",
    "published_at": "2024-05-10T07:18:06Z",
    "content": "My Money Blog  The 2024 Berkshire Hathaway Annual Shareholder Meeting occurred on May 4th, 2024, and while there are lots of articles offering highlights (including this one), it’s never the same feeling as tuning into the actual thing.  I always find a few nuggets that mean something to me, even if just a small side remark.   Warren Buffett, Greg Abel, and Ajit Jain answered questions while we felt the palpable absence of the late Charlie Munger. CNBC again has the broadcast rights.  You can find the full 7+ hour live re-broadcast on CNBC YouTube (at least for now) and they have also uploaded most of it (not all) to the CNBC Buffett Archives site.   Their official transcript is not yet available, but you can find a helpful transcript from Steady Compounding or listen to the audio podcast version here.    Personally, I like to listen to the audio in the car once, and then read through the transcript for the second round. Here are a few personal takeaways and notes. Charlie Munger tribute.  The meeting started with a video tribute to Charlie Munger, but that part is not included in many of the video links.   Be sure to watch it here on the full video starting at 30:34.   It is a very nice and touching tribute, including many classic Charlie Munger quotes.   He did things his way, all the way to the end.  I always loved that Buffett and Munger genuinely had fun together.   When asked about “one more day with Charlie”, here was part of Buffett’s response: We always lived, in a way where we were happy with what we were doing every day. I mean, Charlie. Charlie liked learning. He liked, as I mentioned in the movie, he liked a wide variety of things. So he was much broader than I was. But I didn’t have any great desire to be as broad as he was. And he didn’t have any great desire to be as narrow as I. But we had a lot of fun doing anything. And, you know, we played golf together, we played tennis together, we did everything together. And this you may find kind of interesting. We had as much fun, perhaps even more to some extent, with things that failed, because then we really had to work and work our way out of them. And in a sense, there’s more fun having somebody that’s your partner in digging your way out of a foxhole than there is just sitting there and watching an idea that you got ten years ago just continually produce more and more profits. So it wasn’t, you know, he really fooled me, though. He went to 99.9 years. I mean, if you pick two guys, you know, he never publicly said he never did a day of exercise except where it was required when he was in the army. He never did a day of voluntary exercise. He never thought about what he ate. You know, we started every day, and Charlie had. He was interested in more things than I was, but we never had any doubts about the other person, period. And so if I’d had another day with him, we’d probably have done the same thing we were doing the earlier days and we wouldn’t have wanted another. The only book available at their on-site bookstore this year was the new 2023 edition of Poor Charlie’s Almanack: The Essential Wit and Wisdom of Charles T. Munger. Current Berkshire Hathaway stock price is close to intrinsic value.   Berkshire’s cash pile keep growing, and sometimes it buys back shares when Buffett thinks it’s a good deal for existing shareholders.   Right now, it seems like Buffett thinks it is only slightly undervalued to intrinsic value.  Historically, buying BRK when BRK buys a lot of BRK has been a pretty good bet.  (Say that three times fast!) And our stock is at a level where it adds slightly to the value when we buy in shares. But we would. We would really buy it in a big way, except you can’t buy it in a big way because people don’t want to sell it in a big way, but under certain market conditions, we could deploy quite a bit of money in repurchases. And as you’ll see on the final slide, we have bought it in the last five years. We can’t buy them like a great many other companies because it just doesn’t trade that way. Buffett sees higher tax rates as likely in the future, at least for corporations.   When asked why he trimmed his position in Apple stock, Buffett (as he often does) redirected the question a bit to taxes. We don’t mind paying taxes at Berkshire, and we are paying a 21% Federal rate on the gains we’re taking in Apple. And that rate was 35% not that long ago, and it’s been 52% in the past when I’ve been operating. And the government owns. The Federal government owns a part of the earnings of the business we make. They don’t own the assets, but they own a percentage of the earnings, and they can change that percentage any year. And the percentage that they’ve decreed currently is 21%. And I would say with the present fiscal policies, I think that something has to give, and I think that higher taxes are quite likely, and the government wants to take a greater share of your income, or mine or Berkshire’s, they can do it. And they may decide that someday they don’t want the fiscal deficit to be this large, because that has some important consequences, and they may not want to decrease spending a lot, and they may decide they’ll take a larger percentage of what we earn and we’ll pay it.  […] And if I’m doing it at 21% this year and we’re doing it at a higher percentage later on, I don’t think you’ll actually mind the fact that we sold a little Apple this year. Living a good life.   As usual, he dropped some good general life advice. But the opportunity in this country is basically limitless. When you think of going back not that many centuries, if you were going to be a shepherd or something like that, 100 years from now, your grandson was a granddaughter, was going to be a shepherd, nothing really happened. And what has happened in the last 200 years with the combination of the industrial revolution, whether it’s science or education or health, you name it. We are so lucky to be born when we were the people in this room, and many of us were lucky enough to be born in the United States as well, that you. You’re entering the best world that’s ever existed, and you want to find the people to share it with and the activities to participate in that fit you. And if you get lucky, like Charlie and I did, you find things that interest you young. But if you don’t find them right away, you keep looking. And I always tell students to take the job. I mean, find the job that you would like to have if you didn’t need a job. And sometimes you can find that very early, and sometimes you go through various experiences, but don’t forget what you actually are trying to do, and there’s no place to do it like this country. Find the person that you like to share your life with in many cases. And, you know, sometimes you get lucky into that early, and sometimes you make mistakes. But I would try to, in a very, very general way, I would try to figure out how you’d want to look back on your life and think about yourself and start today to go on the path that leads to that goal and expect some difficulties along the way. But if you’re thinking that way, you’re more likely to get there. Keep trying, expect bumps, appreciate what you already have, and don’t let envy ruin it all.  This Munger quote from the 2023 Daily Journal shareholder meeting sticks in my head:  “I can’t change the fact that a lot of people are very unhappy and feel very abused after everything’s improved by about 600% because there’s still somebody else who has more.” Berkshire shareholders as both savers and givers.  Buffett reinforced the stereotype that Berkshire Hathaway shareholders are different and tend to be relatively frugal, practical, and not focused on outward appearances.   Not only did a shareholder donate $1 billion dollars to a medical school in the past year (such that tuition will be free in perpetuity), but it didn’t even require them to change the name of the school.   Another BRK shareholder just anonymously donated $500 million. The next generation is fully in place.  My overall impression was that while Buffett is still the top guy, with the passing of Charlie he has psychologically already passed the baton to Greg Abel and Ajit Jain.  Abel is who all the subsidiary business managers deal with on a daily basis.   Ajit is fully in control of the insurance side.   Buffett basically said that Berkshire should be good for the next 20 years and he’s done the best he can (knock on wood). We’ve really got the problem solved for the next 20 years unless something untoward happens. And if something untoward happens, then. Then the directors need to find, probably within our own organization, somebody that they’ve got confidence in to maintain the special advantages we have over another 20 years period. There’s various things that are low probabilities, but you still have to think about them, and we are in that position now. Now, if you asked me whether. If something happened to Greg today, everybody says, don’t travel on the same plane. The thing to do is not travel in the same auto. Planes don’t go down that often. Autos crash all the time. I’ve seen all these corporate policies on that, which are kind of crazy when you think about the real risk. But in any event, Greg is going to have to tell the directors about what if something happened tomorrow. He has to tell the directors about what should be done if anything happens to him. And that’s not an easy thing to do, and I don’t have. Buffett will still be there to make sure that they properly pounce during the next crisis when everyone is scared but Berkshire.   I get the sense that is really the only thing left that would get him really excited: the possibility of a future big moment with lots of buying opportunities.  A few last big brush strokes for his masterpiece. And that’s sort of the story of Berkshire. We’ll try to increase operating earnings, and we will try to reduce shares when it makes sense to do so. And we will hope for an occasional big opportunity. And we’re quite satisfied with the position we’re in.  Name * Email * Website  Notify me of follow-up comments by email.  Notify me of new posts by email.  \n\n  Return to top of page Copyright © 2024 · Minimum Child Theme 2.0.1 on Genesis Framework · WordPress · Log in"
  },
  {
    "title": "Donazioni e imposta di successione, il fisco italiano è il più generoso d’Europa: le esenzioni e la riforma",
    "description": "Il gettito dell’imposta è piuttosto modesto (1.043 milioni nel 2022) e significativamente inferiore a quello dei principali Paesi europei. Non si paga nessuna imposta se la somma trasferita è inferiore a 1 milione di euroIl gettito dell’imposta è piuttosto mo…",
    "published_at": "2024-05-10T06:10:10Z",
    "content": "\nFedez e la rissa nel privé della discoteca, poi il pestaggio di Iovino. «Picchiato dagli ultrà del Milan» Salva questo articolo e leggilo quando vuoi. Il servizio è dedicato agli utenti registrati. Trovi tutti gli articoli salvati nella tua area personale nella sezione preferiti e sull'app Corriere News. Il gettito dell’imposta di successione nei primi cinque Paesi in Europa (fonte osservatorio Conti pubblici della Cattolica di Milano) L’intelligenza artificiale applicata al fisco, la digitalizzazione dell’economia, la tracciabilità? Nessuno può ragionevolmente augurarsi uno scenario distopico e dittatoriale. Un Grande Fratello che tutto spia e tutto sa. La lotta all’evasione fiscale non è solo una questione tecnologica, ma soprattutto civica, culturale, ha scritto su queste colonne Ferruccio de Bortoli, già direttore del Corriere della Sera.  \n                    \n                    \n                di  Isidoro Trovato \n\n Quel che è certo però è che sui lasciti per i figli siamo oggettivamente super-generosi, almeno confrontando le imposte di successione pagate in Italia rispetto agli altri Paesi europei. Scrive il ricercatore Francesco Scinetti dell’Osservatorio Conti pubblici della Cattolica di Milano, che «l’imposta sulle successioni e sulle donazioni italiana è caratterizzata da franchigie (ossia esenzioni) elevate e da aliquote basse e poco progressive. Di conseguenza, il gettito dell’imposta è piuttosto modesto (1.043 milioni nel 2022) e significativamente inferiore a quello dei principali Paesi europei». \n                    \n                    \n                di  Stefano Poggi Longostrevi \n\n Peccato, aggiungiamo noi, perché potrebbe essere uno strumento di equità sociale meno distorsivo delle imposte sui redditi. «L’esempio dei Paesi europei a noi più simili suggerisce che aumentare il gettito derivante da questo tipo di imposta è possibile. Fra l’altro, prima della riforma introdotta dal governo Amato nel 2000, la tassazione di successioni e donazioni era molto più alta anche in Italia», aggiunge Scinetti. L’imposta sulle successioni e sulle donazioni attualmente in vigore in Italia si applica a tutte le eredità e alle donazioni tra vivi, con aliquote e franchigie differenziate a seconda del grado di parentela tra chi effettua e chi riceve il trasferimento di beni: Per i trasferimenti in favore del coniuge o parenti in linea diretta (figli,nipoti, genitori) l’aliquota è del 4 per cento del valore ricevuto (alnetto di eventuali debiti), ma ogni beneficiario ha una franchigia di 1milione di euro (cioè non paga nessuna imposta se la somma trasferitaè inferiore a 1 milione) \n\n\n\n Quanto si paga in Italia per 1 milione di euro lasciato ai figli: zero (fonte Osservatorio Conti Pubblici) Per questo è interessante la posizione di Marco Cerrato, partner dello studio tributario Maisto e Associati, che evidenzia come negli ultimi due anni si sia aperto un dibattito acceso sulla possibilità di rivalutare simili forme di tassazione, quanto meno per i detentori di patrimoni significativi. Cerrato si riferisce ad esempio alla proposta del presidente Usa Joe Biden di tassare con un aliquota minima del 25% i redditi dei detentori di patrimoni superiori a 100 milioni di dollari, alla raccolta di firme in atto per una proposta di direttiva comunitaria per una imposta patrimoniale volta a finanziarie la transizione ecologica, fino al rapporto sull’evasione fiscale globale dell’EU Tax Observatory che propone una minimum tax  da prelevare annualmente con una aliquota del 2% sui patrimoni eccedenti 1 miliardo di euro (qui un suo commento sul regime non-dom attualmente in uso in Gran Bretagna).  \n                    \n                    \n                di  Valentina Iorio \n\n «Sembra essere stata presa in seria considerazione, tanto che è all’ordine del giorno degli incontri del G20 in programma a San Paolo del Brasile nel giugno 2024 ed è stata sostenuta dal ministro delle finanze francese Le Maire e più recentemente, in un articolo pubblicato dal Guardian lo scorso 25 aprile, dai ministri delle finanze di Germania, Spagna, Sudafrica e Brasile. Sullo sfondo vi è l’attesa di un passaggio di patrimoni  intragenerazionale entro il 2045 da parte di chi è nato prima del 1964 che, solo negli Stati Uniti, secondo uno studio di Cerulli Associates recentemente citato dal Financial Times, è stimato in circa 90 trilioni di dollari», spiega Cerrato. Osserva invece Scinetti che «la struttura della della tassa sulle donazioni e le successioni italiana attuale è piuttosto “generosa” rispetto a quella di altri Paesi europei perché ha aliquote più basse, meno progressive efranchigie più elevate. Va considerato che, nel determinare a quanto ammonta il trasferimento, il valore degli immobili viene calcolato nonsecondo il loro valore di mercato, ma in base al loro valore catastale che spesso è molto inferiore al valore di mercato, riducendo quindi anche il valore complessivo della base imponibile dell’imposta di successione». Ora il governo sta lavorando a un decreto legislativo in materia di imposta sulle donazioni e successioni il cui testo, approvato in via preliminare dal Consiglio dei ministri lo scorso 9 aprile, sarà a breve sottoposto al vaglio delle commissioni parlamentari. L’intervento ha una funzione di razionalizzazione delle norme. Oltre ad introdurre un sistema di autoliquidazione dell’imposta di successione. Ma «si tratta di interventi di limatura che non preludono ad uno stravolgimento del sistema impositivo vigente su successioni e donazioni, tra i meno onerosi in Europa. Un incremento delle aliquote applicabili non sembra all’ordine del giorno dell’attuale esecutivo», dice Cerrato. \nBerkshire Hathaway, la Woodstock del capitale festeggia Warren Buffett: 93 anni e 364 miliardi \nCrediti d’imposta e detrazioni fiscali, l’Upb: «Favoriscono i ricchi, inaccessibili ai poveri» \nMario Monti: «Berlusconi mi offrì la guida del centrodestra. Purtroppo ora l’Italia è di nuovo a rischio» \nBollo, imposta di registro e tassa di successione: che cosa cambia adesso? \nEredità Agnelli, il Riesame: «Verosimile che John, Ginevra e Lapo Elkann fossero consapevoli della frode» \nPatrimoni, a figli e nipoti stanno per arrivare 200 miliardi di ricchezza: ma che fine faranno? \nSuperbonus 110%, la maxi tassa colpisce chi vende entro dieci anni (ma ci sono due eccezioni) \nEredità e successione: come pagare meno tasse investendo in Btp, polizze e buoni postali \nBasf, l’ereditiera dell’impero donerà 25 milioni di euro: «Se la politica non tassa i ricchi, redistribuisco io» \nDel Vecchio, da Delfin alla conferma di Milleri: si lavora alla pace tra gli eredi \n\n\n \nIscriviti alle newsletter di L'Economia\n \n\n\nLe idee di Ferruccio de Bortoli e Daniele Manca\nI fatti e le persone letti attraverso la lente dell'economia.\n \n\nWhatever it Takes di Federico Fubini\nLe sfide per l’economia e i mercati in un mondo instabile\n \n\nEurope Matters di Francesca Basso e Viviana Mazza\nL’Europa, gli Stati Uniti e l’Italia che contano, con le innovazioni e le decisioni importanti, ma anche le piccole storie di rilievo\n \n\nOne More Thing di Massimo Sideri\nDal mondo della scienza e dell’innovazione tecnologica le notizie che ci cambiano la vita (più di quanto crediamo)\n \nE non dimenticare le newsletter \n L'Economia Opinioni e L'Economia Ore 18\n\n 10 maggio 2024 ( modifica il 10 maggio 2024 | 08:10) \n            © RIPRODUZIONE RISERVATA\n         \n                            \n                                                            \n                                                    di  Redazione  Economia"
  },
  {
    "title": "Column-Forget market angst, just 'KISS' and make up: Mike Dolan",
    "description": "Column-Forget market angst, just 'KISS' and make up: Mike Dolan",
    "published_at": "2024-05-10T06:05:55Z",
    "content": null
  },
  {
    "title": "Forget market angst, just 'KISS' and make up: Mike Dolan",
    "description": "(marketscreener.com) Worried about a hawkish Fed,\nover-valued stocks, teetering debt piles, volatile currencies,\ncliffhanger elections or rancorous geopolitics? Relax and don't\nover-think it.\n For those with long-term savings horizons, the temptation to\novert…",
    "published_at": "2024-05-10T06:00:00Z",
    "content": null
  },
  {
    "title": "India's near 8% GDP growth isn't transforming into stock market returns. Here's why",
    "description": "This year has also been particularly unlucky for Indian stock market investors thanks to the uncertainty added by politics.",
    "published_at": "2024-05-10T05:13:00Z",
    "content": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  This report is from this week's CNBC's \"Inside India\" newsletter which brings you timely, insightful news and market commentary on the emerging powerhouse and the big businesses behind its meteoric rise. Like what you see? You can subscribe here. Warren Buffett once bet that an investment in an S&P 500 tracker would outperform most hedge funds.  Yet, that wager by the \"Oracle of Omaha,\" who held Berkshire Hathaway's annual shareholder meeting over the weekend, would have also outperformed many other indexes too, including the BSE India Sensex and the Nifty 50.  For local investors, Indian stocks would have underperformed the U.S. benchmark by more than 45 percentage points since Buffett's 2008 bet. For foreign investors, returns would have been worse in U.S. dollar terms with a 280 percentage point gap between the two indexes. It is also a story that's playing out today. The S&P 500 is up 9% this year, whereas the Indian benchmark is struggling to stay in the black. It appears that India's near 8% GDP growth isn't transforming into stock market returns. So, what's missing?  \"If you were a top-down investor, India looks amazing because it's got everything going for it,\" said Jonathan Pines, a contrarian investor and portfolio manager at Federated Hermes, who believes Indian stocks have a \"completely crazy valuation.\"  Pines believes the Indian economy's rapid expansion has been tied together with the birth of new businesses and opportunities. But that has also meant significant competition for the incumbents, many of which are listed on the stock market.  \"Even if India is going to get rapid GDP per capita growth, it doesn't mean that the entire stock market is going to grow its earnings at the same rate because you're going to get competition,\" he added.  Setting aside the comparison with the United States, where GDP per capita is more than $76,000, it would also be unfair to compare India with itself from a decade or two ago, according to Rajeev Agrawal, hedge fund manager and managing partner at DoorDarshi India Fund.  India's GDP per capita was $624 two decades ago and has risen 300% since. Agrawal thinks breaching the $2,500 mark has meant that Indian consumers now, for the first time, can spend on discretionary items, the hallmark of stock market growth worldwide.  This year has also been particularly unlucky for Indian stock market investors thanks to the uncertainty added by politics.  Analysts point to speculation that a dip in voter turnout during the first two phases of the ongoing general elections could mean that Prime Minister Narendra Modi's BJP may win fewer parliamentary seats than expected.  The India VIX index, more widely known as a fear gauge, has risen for 11 straight days, the longest run since March 2020. The index hit a record low before the election, but has since had its highest close in more than a year. Finally, several Indian stocks also appear to be deflating out of a bubble, according to Kevin Carter, chief investment officer of the firm behind the India Internet & Ecommerce ETF.  For instance, One97 Communications, the owner of fintech giant Paytm and once backed by Buffett, has fallen nearly 80% since its IPO in 2021. Aside from its valuation normalizing, one of its former affiliates is dealing with a regulatory crisis. But market watchers say increased volatility and lackluster index performance mean there's money to be made if investors look closer. \"This whole story is so early in India, and yes, there was a pandemic-fueled bubble. But that doesn't mean that the opportunity for real investors doesn't still exist,\" Carter added. \"If you thought the Indian opportunity looked good before, you can [now] get twice as much of it for the same price.\"  Ignore the turbulence in Indian banks, like HDFC, as the central bank tightens the screws and instead turn toward microfinance lenders such as Ujjivan Financial Services, Agrawal said. The former is down 12% over the past year, while the latter has more than doubled. Modi casts his vote at election half-way point. India's election crossed the half-way stage this week with counting set to begin on June 4. Prime Minister Narendra Modi cast his ballot on Tuesday in the Gandhinagar Lok Sabha constituency in the west of the country. Modi's close aide, Amit Shah, is the BJP candidate there. Four arrested on suspicion of duping men into fighting for Russia. Four people have been detained by Indian police on suspicion of luring young men to fight for Russia against Ukraine. They were reportedly promised lucrative jobs or university places. So far, about 35 people have been lured into such situations, according to India's Central Bureau of Investigation. Mumbai Indians drop out of the Indian Premier League. The cricket club on Wednesday was the first to be knocked out of the 2024 tournament. At the time of the keystroke, Royal Challengers Bengaluru were facing Punjab Kings and had the upper hand. Virat Kohli and Rajat Patidar are at the wicket 95 for 2. The Indian stock market indexes, the Sensex and Nifty 50, are having a miserable week — both down about 2%. The benchmarks have nearly given up all their gains for the year, up by under 1% since January.  The 10-year Indian government bond yield crawled lower in the last week to 7.13%. The Indian rupee dipped and then trimmed its losses against the U.S. dollar. On CNBC TV this week, we had Praveer Sinha, the CEO of Tata Power, who discussed what the company is doing to boost its renewable energy capacity. He predicted \"huge growth\" in the country's power demand over the next decade. We also had more on Qualcomm, with Savi Soin, the president of the firm's India unit, discussing opportunities in the Indian market. And keeping with the tech theme, Ahmed Mazhari, the president at Microsoft Asia, spoke of the company's investments in Asia. He said India had a \"great number of graduates\" but questioned how many of them have the \"skills and the proficiencies of today.\" The elections will continue next week with voting staggered until June 1 and counting starting a few days afterward. Next week, we'll have a listing for Aadhar Housing Finance, with shares available on the secondary market of the NSE and BSE on Wednesday. TBO Tek, a travel distribution platform, will also list on Wednesday after the subscription period closes Friday. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
  },
  {
    "title": "Buffett przejechał się na rozrywce. Wtopił na spółce od Wilka z Wall Street i Mody na Sukces",
    "description": "„Straciliśmy sporo pieniędzy. To się zdarza w tym biznesie” – powiedział miliarder Warren Buffett na dorocznym majowym spotkaniu akcjonariuszy Berkshire Hathaway. Chodziło mu o inwestycję w giganta rozrywki, jakim jest Paramount Global. Buffetta w spółce już …",
    "published_at": "2024-05-10T04:08:10Z",
    "content": "„Straciliśmy sporo pieniędzy. To się zdarza w tym biznesie” –\npowiedział miliarder Warren Buffett na dorocznym majowym spotkaniu\nakcjonariuszy Berkshire Hathaway. Chodziło mu o inwestycję w giganta rozrywki, jakim jest Paramount Global. Buffetta w spółce już nie ma, ale firmę chce\nprzejąć Sony. Paramount Global to amerykański potentat na rynku\ntelewizyjnym i filmowym, właściciel między innymi stacji MTV, Viva, Comedy\nCentral czy studia filmowego Paramount Pictures, które stoi za takimi filmami,\njak trylogia \"Ojca Chrzestnego\", \"Titanic\", \"Top Gun\" czy \"Wilk z Wall Street\". Ich stacja\nCBS od 1987 r. emituje \"Modę na Sukces\", której lista odcinków liczyła na 9 maja\n9269 epizodów.  Na początku 2022 r. w Paramount Global, kiedy ten był\nwyceniany na ponad 20 mld dolarów, zaczął inwestować Buffett za\npośrednictwem Berkshire Hathaway. Wtedy kupił 68,94 mln akcji o wartości 1,9\nmld dol. na koniec I kw. 2022 r. Pozycję zwiększał w\nkolejnych okresach, dokupując kolejno w większych pakietach 9,47 mln\nakcji, 12,79 mln akcji i 2,42 mln akcji aż dobił do 93,73 mln akcji rok temu i\nbył drugim największym akcjonariuszem spółki.  Tyle że według raportu 13f za I kwartał 2023 r. już znacznie większy pakiet akcji był wart tylko 2 mld dolarów. Z perspektywy całego\nholdingu to było wciąż poniżej 1 proc. w portfelu Berkshire Hathaway, ale uśrednianie w dół ewidentnie\nnie wyszło Buffetowi na dobre, bo straty były widoczne gołym okiem.   Paramount Global zaczął wykazywać pogłębiający się spadek przychodów,\nobciął dywidendę, a jego prezes zrezygnował z funkcji. W 2022 r. pokazywane\nwyniki były dużo gorsze od prognoz, a akcje leciały na łeb, także w nawiązaniu\ndo ogólnoświatowego sentymentu na rynkach pogrążonych w bessie. Tylko w 2022 r. kurs Paramount spadł o 44\nproc. Rok 2023 r. nie przyniósł poprawy.  Od momentu ujawnienia się Buffetta w Paramount, w maju 2022\nroku, notowania spółki straciły do teraz 55 proc., a przecież zakup największego\npakietu akcji trwał wcześniej, powyżej 30 dolarów, a i kurs Paramount ostatnio\nodbił z okolic covidowego dołka na poziomie ok. 10 dolarów z uwagi na\ninformację o potencjalnym przejęciu spółki przez Sony, o czym później. Buffet w końcu dał za wygraną i w IV kwartale 2023 r. sprzedał\n30,4 mln akcji Paramount. Na koniec roku zostało mu wciąż 63,3 mln, ale ich wartość\nwynosiła już tylko 936 mln dolarów. Przypomnijmy, że w 2022 r. większy pakiet\nkupił za blisko 2 mld dol. Ostanie\nspotkanie z akcjonariuszami Berkshire Hathaway w Omaha rozwiało kilka\nwątpliwości co do nietrafionej inwestycji w giganta rozrywki.  Po pierwsze Buffet ogłosił, że w poprzednim kwartale pozbyto\nsię pozostałych akcji Paramount. „Sprzedaliśmy wszystko i straciliśmy sporo\npieniędzy. To się zdarza w tym biznesie” – oznajmił miliarder. Po drugie wziął całą\nodpowiedzialność na siebie za nietrafiony wybór. Mówiło się, że za inwestycją\nstoi jeden z jego następców. „Zrobiłem to wszystko sam”- przekonywał\nBuffett.  „Właściwie posiadanie Paramount skłoniło mnie do jeszcze\ngłębszych przemyśleń, ale z pewnością uważniej podszedłem do pytania, co ludzie\nrobią ze swoim czasem wolnym i jakie są zasady rządzące jakąkolwiek działalnością\nrozrywkową, niezależnie od tego, czy jest to sport, filmy czy cokolwiek innego”\n– stwierdził.  „Jestem teraz mądrzejszy niż kilka lat temu, ale jestem też biedniejszy,\nponieważ w taki sposób zapłaciłem za zdobytą wiedzę” – skomentował w swoim\nstylu Warren Buffett.  To oczywiście nie pierwsza porażka inwestycyjna Buffetta w\nostatnim czasie. Poza sukcesami naznaczonymi inwestycjami w Apple, chiński BYD czy\njapońskie „sogo sosha”, można mówić o wpadce\nw przypadku inwestycji w HP. Inwestycja w Paramount przyniosła stratę, ale lepiej\nradzą sobie notowania innych spółek z branży rozrywkowej, które kupił Berkshire\nHathaway.  Mowa o akcjach monitorujących (tracking stock) Grupy Liberty Media. Ich notowania umożliwiają uzyskanie rynkowej\nwyceny dla spółek zależnych czy wyodrębnionych działów firmy, a nie całej grupy\njako całości. W przypadku Liberty są to Liberty SiriusXM Group, Formula One\nGroup i Liberty Live Group. To spółki zajmujące się radiem, streamingiem muzyki, organizacją\nkoncertów i sprzedażą biletów. Jedna z nich prowadzi klub Atlanta Braves występujący\nw lidze baseballu (MLB), a inna posiada wyścigową serię Formuły 1. Ich akcje, mimo spadków w tym roku, od czasów wejścia Buffetta notowane są na plusach.  Na koniec warto wspomnieć, o tym co się dzieje w Paramount\nGlobal po tym jak Buffett wyszedł ze spółki. Od dłuższego czasu akcjonariusze mniejszościowi\nobserwowali negocjacje w sprawie fuzji firmy ze Skydance Media, podnosząc obawy\nprzed ich rozwodnieniem. Tydzień temu wygasła wyłączność potencjalnych nabywców\nna prowadzenie rozmów w tej sprawie i do gry włączyło się Sony Pictures\nEntertainment i Apollo Global Management - gigant rynku private equity -  ze wspólną\ngotówkową ofertą opiewającą na 26 mld dolarów.  Jak poinformował New York Times w ubiegłą sobotę, zarząd\nParamount Global formalnie udzielił zgody na rozpoczęcie negocjacji w sprawie\npotencjalnego przejęcia przez Apollo i Sony. Według doniesień Sony planuje\npołączyć segmenty marketingu i dystrybucji studia filmowego Paramount z własną\ndziałalnością oraz zbyć resztę aktywów.  Najnowsze doniesienia mówią o sprzedaży stacji telewizyjnej\nCBS, a także kanałów Nickelodeon i MTV oraz usługi transmisji strumieniowej\nParamount+. Z opisu NYT wynika, że ​​Shari Redstone, większościowa akcjonariuszka\nParamount, wolałaby nie rozbijać firmy, ale jest gotowa na ustępstwa. Spółka\nma 14,6 miliarda dolarów zadłużenia długoterminowego i zaledwie 2,5 miliarda\ndolarów w gotówce i ekwiwalentach, a co najważniejsze od dłuższego czasu prowadzony\nbiznes nie notuje wzrostu.  Według Reutersa połączenie Paramount z Sony stworzyłoby hollywoodzkie studio o wielkości Universala lub Walt Disney Studios. Według\nanalizy udziału w rynku przeprowadzonej przez Comscore, na podstawie sprzedaży\nbiletów w 2023 r., połączenie zapewniłoby Sony 20,5 proc. udziału w sprzedaży\nbiletów w Ameryce Północnej.  Patrząc na kwotę transakcji, można dojść do wniosku, że\nBuffett dostrzegł wartość Paramount, ale zapłacił zbyt dużą cenę. Był\nprzekonany do swoje decyzji, dlatego dokupywał akcje (złośliwi powiedzą, że uśredniał\nw dół), realizując założoną strategię. Brak zwrotu z kapitału, obcięcie dywidendy i niejasna przyszłość, która zaczęła\nsię coraz bardziej komplikować, spowodowały zamknięcie inwestycji ze stratą. Jak\nwidać, zdarza się najlepszym. Michał Kubicki  Mercedes - samochody elektryczne w wyprzedaży rocznika Rosyjscy hakerzy przejęli sygnał stacji TV i pokazali paradę zwycięstwa w Moskwie AstraZeneca wycofuje szczepionkę przeciw COVID-19 Minister finansów o inflacji. Tyle ma wynieść pod koniec roku Orban: Potrzebujemy chińskich policjantów z powodu napływu turystów z Chin Glapiński: W najbliższych kwartałach inflacja może wzrosnąć, raczej na pewno wzrośnie Korzystanie z portalu oznacza akceptację regulaminu"
  }
]