[
  {
    "title": "Charlie Munger: la brújula inversora de Buffett",
    "description": "Charlie Munger ha sido el gran cerebro del gigante de la inversión Berkshire Hathaway durante medio siglo; no había decisión empresarial que Warren Buffett no consultara con él. Leer",
    "url": "https://www.expansion.com/podcasts/genios-finanzas/2024/05/10/663cac42e5fdeac4518b4594.html",
    "published_at": "2024-05-09T23:37:17Z"
  },
  {
    "title": "Does the VanEck Wide Moat ETF pay a decent ASX dividend?",
    "description": "Does this ETF deliver high income, as well as strong capital growth?\nThe post Does the VanEck Wide Moat ETF pay a decent ASX dividend? appeared first on The Motley Fool Australia.",
    "url": "https://www.fool.com.au/2024/05/10/does-the-vaneck-wide-moat-etf-pay-a-decent-asx-dividend/",
    "published_at": "2024-05-09T22:30:00Z"
  },
  {
    "title": "ESG: A zrodila se odbornost",
    "description": "Vzpomínáte na 50. léta, kde se z dělnických kádrů v rychlostudiu na středních i vysokých školách stávali politicky kovaní vedoucí pracovníci, takzvané rychlokvašky?",
    "url": "https://neviditelnypes.lidovky.cz/ekonomika/esg-a-zrodila-se-odbornost.A240507_190703_p_ekonomika_nef",
    "published_at": "2024-05-09T22:00:00Z"
  },
  {
    "title": "Texas Pacific Land Trust (TPL) The Story of Certificate 390",
    "description": "One of my favorite stock market stories involves a lost share certificate. The Texas Pacific Railway went broke in 1885. To compensate bondh...",
    "url": "https://www.dividendgrowthinvestor.com/2024/05/texas-pacific-land-trust-tpl-story-of.html",
    "published_at": "2024-05-09T21:21:00Z"
  },
  {
    "title": "Warren Buffett contó una mala experiencia con la Inteligencia Artificial e hizo una fuerte advertencia: “Me asusta”",
    "description": "En su reunión anual de Berkshire Hathaway, el “Oráculo de Omaha” se refirió al avance de este tipo de tecnología y la comparó con las armas nucleares",
    "url": "https://www.lanacion.com.ar/estados-unidos/warren-buffett-conto-una-mala-experiencia-con-la-inteligencia-artificial-e-hizo-una-fuerte-nid09052024/",
    "published_at": "2024-05-09T18:04:55Z"
  },
  {
    "title": "1 Warren Buffett-Owned Stock With 36% Upside This Year",
    "description": "One of the major themes at Warren Buffett’s Berkshire Hathaway (NYSE: BRK-B) shareholder meeting earlier this month was AI. While he warned of deepfakes, the billionaire also believes it could be the “growth industry of all time.” It’s no secret the Oracle of…",
    "url": "https://biztoc.com/x/3ded05e66fa2d1a0",
    "published_at": "2024-05-09T14:14:09Z"
  },
  {
    "title": "Wall Street Thinks This Warren Buffett Stock Pick Has 27% Upside",
    "description": "When Warren Buffett and Berkshire Hathaway Inc. (NYSE: BRK-A) part with shares of Apple Inc. (NASDAQ: AAPL), the largest stake in the Berkshire portfolio, it makes headlines. Of course it does. The so-called Oracle of Omaha is probably the best-known investor…",
    "url": "https://biztoc.com/x/540c8c9a4e32651c",
    "published_at": "2024-05-09T14:14:08Z"
  },
  {
    "title": "Warren Buffett hromadí hotovost a prodal akcie Applu. Máme se obávat propadů na trzích?",
    "description": "Warren Buffett prodal více než sto milionů kusů akcií společnosti Apple a nahromadil rekordní sumu hotovosti. I takové informace přinesla konference investičního gigantu Berkshire Hathaway ze začátku května. Ta se letos poprvé odehrála bez zesnulého Charlieho…",
    "url": "https://archiv.hn.cz/c1-67321850-warren-buffett-hromadi-hotovost-a-prodal-akcie-applu-mame-se-obavat-propadu-na-trzich",
    "published_at": "2024-05-09T14:14:00Z"
  },
  {
    "title": "A Conversation With Warren Buffett On Philanthropy",
    "description": "Explore Warren Buffett's views on corporate philanthropy, his relationship with GLIDE and Marc Benioff's new role in the Power of One Charity Lunch Auctions.",
    "url": "https://www.forbes.com/sites/alexanderpuutio/2024/05/09/a-conversation-with-warren-buffett-on-philanthropy/",
    "published_at": "2024-05-09T13:55:00Z"
  },
  {
    "title": "Scrimping and saving to start your snowball rolling",
    "description": "It's snow joke. (Sorry!)\nThe post Scrimping and saving to start your snowball rolling appeared first on Monevator.",
    "url": "https://monevator.com/saving-snowball/",
    "published_at": "2024-05-09T10:25:44Z"
  },
  {
    "title": "Billionaire Bill Gates Has 51% of His Portfolio Invested in 2 Brilliant Stocks",
    "description": "The Bill and Melinda Gates (BMG) Foundation Trust had $42 billion invested across 24 stocks as of the fourth quarter, but 51% of that sum was concentrated in two positions: 34% in Microsoft (NASDAQ: MSFT) and 17% in Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK…",
    "url": "https://biztoc.com/x/79634f37959fc4fd",
    "published_at": "2024-05-09T09:44:04Z"
  },
  {
    "title": "Buffett: Η τεχνητή νοημοσύνη με τρομάζει όπως ο διάολος – Το τζίνι βγήκε από το μπουκάλι και απειλεί με όλεθρο",
    "description": "Αρνείται να πηδήξει στο τρένο της τεχνητής νοημοσύνης –τουλάχιστον δεν το παίρνει ακόμη– ο γνωστός επενδυτής και ιδρυτής της Berkshire Hathaway, Warren Buffett, καθώς, όπως επισημαίνει, πρόκειται για μη δοκιμασμένη τεχνολογία, που ακόμη δεν έχει παρουσιάσει δ…",
    "url": "https://i-epikaira.blogspot.com/2024/05/buffett.html",
    "published_at": "2024-05-09T09:13:00Z"
  },
  {
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "published_at": "1970-01-01T00:00:00Z"
  },
  {
    "title": "Apple Stock (NASDAQ:AAPL): 110-Billion Reasons to Buy after Buffett Sold - TipRanks.com",
    "description": "Apple (NASDAQ:AAPL) shocked Wall Street when it announced its massive $110 billion buyback plan (the largest of all time) alongside a generous dividend increase and a side of some better-than-expected quarterly results. Shares shot around 6% higher after the …",
    "url": "https://biztoc.com/x/e8e84576d8f1f2c3",
    "published_at": "2024-05-09T05:42:05Z"
  },
  {
    "title": "Europe's laggard stocks sparkle as superstars hit pause",
    "description": "(marketscreener.com) Investors have been lukewarm about the earnings of some of Europe's star performers, which suggests more neglected corners of the market are popping up on their radar screens, particularly as interest-rate cuts become more likely. \n Europ…",
    "url": "https://www.marketscreener.com/quote/stock/ASML-HOLDING-N-V-12002973/news/Europe-s-laggard-stocks-sparkle-as-superstars-hit-pause-46673110/",
    "published_at": "2024-05-09T05:03:43Z"
  },
  {
    "title": "Vorbereitet für Nach-Buffett-Ära: Die neue Zeit bei Berkshire hat bereits begonnen",
    "description": "Investorenlegende Warren Buffett hat auch mit 93 Jahren nicht die Absicht, sich zur Ruhe zu setzen. Dennoch hat bei seinem Konzern Berkshire Hathaway der Umbruch in eine neue Zeit bereits begonnen - nicht nur personell.",
    "url": "https://www.n-tv.de/wirtschaft/Die-neue-Zeit-bei-Berkshire-hat-bereits-begonnen-article24926446.html",
    "published_at": "2024-05-09T05:03:33Z"
  }
]