[
  {
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "published_at": "1970-01-01T00:00:00Z"
  },
  {
    "title": "Το μεγάλο ερώτημα του Μπάφετ για την AI – που «κανείς δεν μπορεί να απαντήσει» με σιγουριά",
    "description": "Ο Γουόρεν Μπάφετ είναι ο πρώτος που παραδέχεται ότι δεν γνωρίζει πολλά για την τεχνητή νοημοσύνη. Αυτό συνάδει με τη μακροχρόνια φιλοσοφία του να αποφεύγει την τεχνολογία που θεωρεί ότι…\nΤο μεγάλο ερώτημα του Μπάφετ για την AI – που «κανείς δεν μπορεί να απαν…",
    "url": "https://www.naftemporiki.gr/finance/world/1656793/to-megalo-erotima-toy-mpafet-gia-tin-ai-poy-kaneis-den-mporei-na-apantisei-me-sigoyria/",
    "published_at": "2024-05-08T20:58:54Z"
  },
  {
    "title": "IA: gênio indomável ou mal orientado?",
    "description": "A inteligência artificial no sistema financeiro, na política, na agricultura e na sua casa são alguns dos destaques desta newsletter. Confira!",
    "url": "https://valor.globo.com/empresas/noticia/2024/05/08/ia-genio-indomavel-ou-mal-orientado.ghtml",
    "published_at": "2024-05-08T20:15:47Z"
  },
  {
    "title": "2 ASX ETFs to buy and hold forever in your investment portfolio",
    "description": "Wanting to make long term investments? Then check out these ETFs.\nThe post 2 ASX ETFs to buy and hold forever in your investment portfolio appeared first on The Motley Fool Australia.",
    "url": "https://www.fool.com.au/2024/05/09/2-asx-etfs-to-buy-and-hold-forever-in-your-investment-portfolio/",
    "published_at": "2024-05-08T19:30:00Z"
  },
  {
    "title": "Finding The Next Apple Using Buffett's Logic",
    "description": "Finding The Next Apple Using Buffett's Logic Authored by Michael Lebowitz via RealInvestmentAdvice.com, On the heels of Apple’s latest earnings report, the Wall Street Journal shared an article discussing how Apple became such an oversized investment of Warre…",
    "url": "https://biztoc.com/x/e1728e29f230a6da",
    "published_at": "2024-05-08T18:10:05Z"
  },
  {
    "title": "PER APPLE SO' CAZZI: WARREN BUFFETT HA RIDOTTO LA PARTECIPAZIONE NELLA SOCIETÀ DELLA MELA DEL 13%, PASSANDO DA 905 MILIONI DI AZIONI A 790 – IL PIÙ CELEBRE INVESTITORE AL MONDO, CONOSCIUTO COME \"L'ORACOLO DI OMAHA\" PER AVER QUASI SEMPRE INDOVINATO LE SCELTE FINANZIARIE, HA MINIMIZZATO LA SCELTA: SECONDO IL MAGNATE 93ENNE LE ATTUALI POLITICHE FISCALI POTREBBERO PORTARE A UN AUMENTO DELLE TASSE AZIENDALI. MA LA REAZIONE DEL MERCATO NON SI È FATTA ATTENDERE, CONSIDERANDO CHE APPLE È LA PARTECIPAZIONE PIÙ RILREVANTE IN MANO AL SUO FONDO, \"BERKSHIRE HATHAWAY\"",
    "description": "Estratto dell'articolo di www.corriere.it    warren buffett e le azioni di apple 4 «Wall Street è l’unico luogo in cui chi arriva in Rolls-Royce chiede consiglio a chi arriva in metropolitana». Per descrivere Warren Buffett, il più celebre investitore al mond…",
    "url": "https://www.dagospia.com/rubrica-4/business/apple-so-39-cazzi-nbsp-warren-buffett-ha-ridotto-partecipazione-394244.htm",
    "published_at": "2024-05-08T17:36:25Z"
  },
  {
    "title": "Warner Bros puede perder la NBA, pero sus acciones siguen siendo negocio; este es el por qué",
    "description": "Forbes México.\n Warner Bros puede perder la NBA, pero sus acciones siguen siendo negocio; este es el por qué\n\nLos inversores han destrozado las acciones del gigante de los medios, pero a través de la lente de una de las métricas favoritas de Warren Buffett, e…",
    "url": "https://www.forbes.com.mx/warner-bros-puede-perder-la-nba-pero-sus-acciones-siguen-siendo-negocio-este-es-el-por-que/",
    "published_at": "2024-05-08T16:35:13Z"
  },
  {
    "title": "Is Berkshire Hathaway Stock Going to $734,820? 1 Wall Street Analyst Thinks So.",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_2020b576-2d6e-4711-8d35-7699f65b4afa",
    "published_at": "2024-05-08T16:33:00Z"
  },
  {
    "title": "Warren Buffett Paid $1.7 Billion For A Business Without Ever Meeting Its Founders By Using The 'Most Important' Thing in Business",
    "description": "Warren Buffett is known for his astute business practices and hardball negotiation tactics. His company, Berkshire Hathaway Inc., is one of the largest conglomerates and investment companies in the world. It has acquired dozens of companies over the years wit…",
    "url": "https://biztoc.com/x/6ef74bb119ec7578",
    "published_at": "2024-05-08T16:14:06Z"
  },
  {
    "title": "Warren Buffett’s $8 Billion Japan Profit Is A Game-Changer",
    "description": "Warren Buffett’s $8 billion profit from bets on five Japanese trading houses is generating something of a virtuous cycle across Asia.",
    "url": "https://www.forbes.com/sites/williampesek/2024/05/08/warren-buffetts-8-billion-japan-profit-is-a-game-changer/",
    "published_at": "2024-05-08T15:37:41Z"
  },
  {
    "title": "Meet the 2 Stocks Warren Buffett Confessed to Selling, as Well as the Other Core Holding He Likely Sent to the Chopping Block",
    "description": "The sell button loomed large for Warren Buffett and his investment team during the March-ended quarter. In the nearly six decades Warren Buffett has led Berkshire Hathaway (BRK.A -0.11%) (BRK.B -0.24%), he's delivered close to a 4,900,000% aggregate return to…",
    "url": "https://biztoc.com/x/fdf0154a9785a2d2",
    "published_at": "2024-05-08T15:22:09Z"
  },
  {
    "title": "Global Railcar Leasing Industry Report 2024: Market to Grow by Over $20 Billion During 2023-2028, Driven by Increase in Cross-border Transportation Activities",
    "description": "Dublin, May 08, 2024 (GLOBE NEWSWIRE) -- The \"Global Railcar Leasing Market 2024-2028\" report has been added to ResearchAndMarkets.com's offering.The railcar leasing market is forecasted to grow by USD 20.02 bn during 2023-2028, accelerating at a CAGR of 7.24%",
    "url": "https://www.globenewswire.com/news-release/2024/05/08/2877939/28124/en/Global-Railcar-Leasing-Industry-Report-2024-Market-to-Grow-by-Over-20-Billion-During-2023-2028-Driven-by-Increase-in-Cross-border-Transportation-Activities.html",
    "published_at": "2024-05-08T13:46:00Z"
  },
  {
    "title": "In the 2024 Berkshire Hathaway shareholder meeting, Warren Buffett remembered his partner, Charlie Munger, and revealed the secrets of building a successful…",
    "description": "Three tips to find partners you can trust.",
    "url": "https://biztoc.com/x/aa9399728b5e2d63",
    "published_at": "2024-05-08T13:44:11Z"
  },
  {
    "title": "Warren Buffett, perché il re degli investitori non si fida più di Apple",
    "description": "L’«oracolo di Omaha» taglia le azioni Apple del 13%. Quali sono le scommesse del più seguito tra gli investitoriL’«oracolo di Omaha» taglia le azioni Apple del 13%. Quali sono le scommesse del più seguito tra gli investitoriL’«oracolo di Omaha» taglia le azio…",
    "url": "https://www.corriere.it/economia/finanza/24_maggio_08/warren-buffett-perche-l-oracolo-di-omaha-riduce-la-partecipazione-in-apple-e-l-ai-di-palantir-crolla-in-borsa-3bd32a67-d202-4c52-b70a-d932fa339xlk.shtml",
    "published_at": "2024-05-08T13:39:10Z"
  },
  {
    "title": "Warren Buffett Paid $1.7 Billion For A Business Without Ever Meeting Its Founders By Using The 'Most Important' Thing in Business",
    "description": "Warren Buffett is known for his astute business practices and hardball negotiation tactics. His company, Berkshire Hathaway Inc., is one of the largest conglomerates and investment companies in the world. It has acquired dozens of companies over the years wit…",
    "url": "https://biztoc.com/x/6d7cf0b5cdc4317b",
    "published_at": "2024-05-08T13:38:05Z"
  },
  {
    "title": "Warren Buffett nie wie, co zrobić z pieniędzmi. \"Chcielibyśmy je wydać, ale nie wydamy\"",
    "description": "Warren Buffett, słynny inwestor z USA, znów powiększył swoje zasoby. Te wzrosną wkrótce do ok. 200 mld dol. Inwestor nie nie zamierza jednak intensywnie inwestować. Wręcz przeciwnie. - Buffett przez wiele kwartałów będzie zachowywał ostrożność w dokonywaniu n…",
    "url": "https://www.money.pl/gospodarka/warren-buffett-nie-wie-co-zrobic-z-pieniedzmi-chcielibysmy-je-wydac-ale-nie-wydamy-7025353873091552a.html",
    "published_at": "2024-05-08T13:32:33Z"
  },
  {
    "title": "Decision: Company Names Tribunal decision: Berkshire Hathaway Global Ltd",
    "description": "Decision for applicant Berkshire Hathaway Energy Company against registration number 15283666, applicant successful.",
    "url": "https://www.gov.uk/government/publications/company-names-tribunal-decision-berkshire-hathaway-global-ltd",
    "published_at": "2024-05-08T12:38:54Z"
  },
  {
    "title": "HMM: Warren Buffett’s $56 Billion Silent Warning to Wall Street May Portend Trouble for Stocks. A",
    "description": "HMM: Warren Buffett’s $56 Billion Silent Warning to Wall Street May Portend Trouble for Stocks. Although Warren Buffett has consistently shied away from offering negative takes on the U.S. economy and/or stock market during his nearly six-decade tenure as CEO…",
    "url": "https://instapundit.com/646119/",
    "published_at": "2024-05-08T12:36:23Z"
  },
  {
    "title": "Warren Buffett o AI. Co słynny miliarder myśli o sztucznej inteligencji?",
    "description": "Sztuczna inteligencja (AI) stopniowo integruje się z życiem ludzi na całym świecie. Na jej temat wypowiedział się ostatnio znany miliarder Warren Buffett. I nie była to pochlebna wypowiedź, porównał on ją bowiem do wynalezienia bomby atomowej. Podkreślił takż…",
    "url": "https://gadzetomania.pl/warren-buffett-o-ai-co-slynny-miliarder-mysli-o-sztucznej-inteligencji,7025328773278208a",
    "published_at": "2024-05-08T12:29:39Z"
  },
  {
    "title": "Denver-based Johns Manville loses antitrust case to small Washington company",
    "description": "A Denver jury has awarded a small Washington company $20.3 million plus legal fees in its anti-trust lawsuit against Johns Manville Corp., the Denver-based building products maker owned by Berkshire Hathaway Co.",
    "url": "https://www.denverpost.com/2024/05/08/johns-manville-lawsuit-berkshire-hathaway-litigation-antitrust/",
    "published_at": "2024-05-08T12:00:43Z"
  },
  {
    "title": "Here's How You Can Find the Next Apple Using Buffett's Logic",
    "description": "On the heels of Apple’s (NASDAQ: ) latest report, the Wall Street Journal shared an article discussing how Apple became such an oversized investment of Warren Buffett’s company, Berkshire Hathaway (NYSE: ). Given their success with Apple shares, we think it i…",
    "url": "https://biztoc.com/x/f2337039ede46cf9",
    "published_at": "2024-05-08T11:56:04Z"
  },
  {
    "title": "Here Are 3 Big Reasons Berkshire Hathaway Is Sitting on Almost $190 Billion in Cash",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_eab111ae-7691-4411-b7c3-c38b7c9224db",
    "published_at": "2024-05-08T10:03:00Z"
  },
  {
    "title": "Café no McDonald’s, trabalho na rua de casa, adeus ruído: meus dias de Warren Buffett",
    "description": "Henrique Esteter revela os bastidores da conferência da Berkshire Hathaway, o evento que transforma uma pacata cidade dos EUA na capital mundial do mercado financeiro\nThe post Café no McDonald’s, trabalho na rua de casa, adeus ruído: meus dias de Warren Buffe…",
    "url": "https://www.infomoney.com.br/onde-investir/cafe-no-mcdonalds-trabalho-na-rua-de-casa-adeus-ruido-meus-dias-de-warren-buffett/",
    "published_at": "2024-05-08T10:00:00Z"
  },
  {
    "title": "Finding The Next Apple Using Buffetts Logic",
    "description": "On the heels of Apple’s latest earnings report, the Wall Street Journal shared an article discussing how Apple became such an oversized investment of Warren Buffett’s company, Berkshire Hathaway. Given their success with Apple shares we think it is worth unde…",
    "url": "https://realinvestmentadvice.com/finding-the-next-apple-using-buffetts-logic/",
    "published_at": "2024-05-08T09:53:00Z"
  },
  {
    "title": "Pakistan’s Engro Looks To Invest In Other Developing Nations",
    "description": "Engro Corp., a leading Pakistani conglomerate, is looking to do more investment deals in other developing countries after decades running businesses from fertilizer and food to electricity and gas at home.",
    "url": "https://financialpost.com/pmn/business-pmn/pakistans-engro-looks-to-invest-in-other-developing-nations",
    "published_at": "2024-05-08T09:36:10Z"
  },
  {
    "title": "Meet the 2 Stocks Warren Buffett Confessed to Selling, as Well as the Other Core Holding He Likely Sent to the Chopping Block",
    "description": "In the nearly six decades Warren Buffett has led Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B), he's delivered close to a 4,900,000% aggregate return to his company's Class A (BRK.A) shareholders, and practically doubled the annualized total return, including…",
    "url": "https://biztoc.com/x/f4139cc82734acb1",
    "published_at": "2024-05-08T09:28:04Z"
  },
  {
    "title": "Pilot's hiring spree equals the number of people employed by TVA, University of Tennessee",
    "description": "If Pilot's new summer hires formed their own company in Knoxville, it would be the region's third-largest employer.",
    "url": "https://www.knoxnews.com/story/money/business/2024/05/08/pilot-company-summer-job-openings-travel-centers/73587318007/",
    "published_at": "2024-05-08T09:18:54Z"
  },
  {
    "title": "Enrique Hernandez, Jr. Sells 2,549 Shares of Chevron Co. (NYSE:CVX) Stock",
    "description": "Chevron Co. (NYSE:CVX – Get Free Report) Director Enrique Hernandez, Jr. sold 2,549 shares of the company’s stock in a transaction dated Thursday, May 2nd. The shares were sold at an average price of $161.00, for a total value of $410,389.00. Following the co…",
    "url": "https://www.etfdailynews.com/2024/05/08/enrique-hernandez-jr-sells-2549-shares-of-chevron-co-nysecvx-stock/",
    "published_at": "2024-05-08T08:28:44Z"
  },
  {
    "title": "El veterano inversor Warren Buffett acumula más de 200.000 millones en efectivo por un buen motivo: no se fía de la bolsa",
    "description": "Considerado como una de las voces más expertas y certeras en materia de inversión, según el Financial Times, el veterano inversor Warren Buffett ha acumulado una ingente cantidad de efectivo que podría superar los 200.000 millones de dólares en las cuentas de…",
    "url": "https://www.xataka.com/empresas-y-economia/veterano-inversor-warren-buffett-acumula-200-000-millones-efectivo-buen-motivo-no-se-fia-bolsa",
    "published_at": "2024-05-08T07:32:26Z"
  },
  {
    "title": "BYD reiterates that it has no plans to sell in the ‘very protective’ U.S",
    "description": "BYD, the Chinese EV giant backed by Warren Buffett’s Berkshire Hathaway, has global ambitions—expanding its presence in countries like Japan, Thailand, and Mexico to sell its ultra-affordable EVs worldwide. But one market is conspicuously absent: the U.S. The…",
    "url": "https://biztoc.com/x/7539f757fb0320df",
    "published_at": "2024-05-08T04:34:05Z"
  },
  {
    "title": "Japan's Itochu FY net profit comes in flat, lower than estimates",
    "description": "(marketscreener.com) Japanese trading house Itochu\non Wednesday reported 801.8 billion yen \nin net income for the fiscal year ended in March, coming in\nlargely flat from last year and lower than estimates.\n Analysts polled by LSEG expected Itochu to post 818.…",
    "url": "https://www.marketscreener.com/quote/stock/BERKSHIRE-HATHAWAY-INC-11915/news/Japan-s-Itochu-FY-net-profit-comes-in-flat-lower-than-estimates-46657404/",
    "published_at": "2024-05-08T04:27:48Z"
  },
  {
    "title": "Berkshire Hathaway Stock vs SPY: Which Is Best?",
    "description": "While investors have focused on high-flying Magnificent 7 stocks, Warren Buffett’s Berkshire Hathaway has quietly outperformed the SPDR S&P 500 ETF Trust (SPY), the stock market proxy and largest exchange-traded fund on the market. As a conglomerate that owns…",
    "url": "https://biztoc.com/x/d5af1a4020051742",
    "published_at": "2024-05-08T03:10:03Z"
  },
  {
    "title": "BYD reiterates that it has no plans to sell in the ‘very protective’ U.S",
    "description": "BYD, the Chinese EV giant backed by Warren Buffett’s Berkshire Hathaway, has global ambitions—expanding its presence in countries like Japan, Thailand, and Mexico to sell its ultra-affordable EVs worldwide. But one market is conspicuously absent: the U.S. The…",
    "url": "https://biztoc.com/x/a7cf5cde70a6cc06",
    "published_at": "2024-05-08T01:32:03Z"
  },
  {
    "title": "BYD reiterates that it has no plans to sell in the ‘very protective’ U.S.—but hopes that things might get ‘back to normal’ after the election",
    "description": "BYD Americas CEO Stella Li said the U.S. EV market was in a \"confusing stage,\" citing policy uncertainty and slowing consumer adoption.",
    "url": "https://finance.yahoo.com/news/byd-reiterates-no-plans-sell-012813073.html",
    "published_at": "2024-05-08T01:28:13Z"
  },
  {
    "title": "I'd follow Warren Buffett and buy this ASX ETF right now for exposure to Japan stocks",
    "description": "Japan stocks could be an attractive investment today. \nThe post I'd follow Warren Buffett and buy this ASX ETF right now for exposure to Japan stocks appeared first on The Motley Fool Australia.",
    "url": "https://www.fool.com.au/2024/05/08/id-follow-warren-buffett-and-buy-this-asx-etf-right-now-for-exposure-to-japan-stocks/",
    "published_at": "2024-05-08T00:15:07Z"
  },
  {
    "title": "Charlie Munger: la brújula inversora de Buffett",
    "description": "Charlie Munger ha sido el gran cerebro del gigante de la inversión Berkshire Hathaway durante medio siglo; no había decisión empresarial que Warren Buffett no consultara con él. Leer",
    "url": "https://www.expansion.com/podcasts/genios-finanzas/2024/05/10/663cac42e5fdeac4518b4594.html",
    "published_at": "2024-05-09T23:37:17Z"
  },
  {
    "title": "Does the VanEck Wide Moat ETF pay a decent ASX dividend?",
    "description": "Does this ETF deliver high income, as well as strong capital growth?\nThe post Does the VanEck Wide Moat ETF pay a decent ASX dividend? appeared first on The Motley Fool Australia.",
    "url": "https://www.fool.com.au/2024/05/10/does-the-vaneck-wide-moat-etf-pay-a-decent-asx-dividend/",
    "published_at": "2024-05-09T22:30:00Z"
  },
  {
    "title": "ESG: A zrodila se odbornost",
    "description": "Vzpomínáte na 50. léta, kde se z dělnických kádrů v rychlostudiu na středních i vysokých školách stávali politicky kovaní vedoucí pracovníci, takzvané rychlokvašky?",
    "url": "https://neviditelnypes.lidovky.cz/ekonomika/esg-a-zrodila-se-odbornost.A240507_190703_p_ekonomika_nef",
    "published_at": "2024-05-09T22:00:00Z"
  },
  {
    "title": "Texas Pacific Land Trust (TPL) The Story of Certificate 390",
    "description": "One of my favorite stock market stories involves a lost share certificate. The Texas Pacific Railway went broke in 1885. To compensate bondh...",
    "url": "https://www.dividendgrowthinvestor.com/2024/05/texas-pacific-land-trust-tpl-story-of.html",
    "published_at": "2024-05-09T21:21:00Z"
  },
  {
    "title": "Warren Buffett contó una mala experiencia con la Inteligencia Artificial e hizo una fuerte advertencia: “Me asusta”",
    "description": "En su reunión anual de Berkshire Hathaway, el “Oráculo de Omaha” se refirió al avance de este tipo de tecnología y la comparó con las armas nucleares",
    "url": "https://www.lanacion.com.ar/estados-unidos/warren-buffett-conto-una-mala-experiencia-con-la-inteligencia-artificial-e-hizo-una-fuerte-nid09052024/",
    "published_at": "2024-05-09T18:04:55Z"
  },
  {
    "title": "1 Warren Buffett-Owned Stock With 36% Upside This Year",
    "description": "One of the major themes at Warren Buffett’s Berkshire Hathaway (NYSE: BRK-B) shareholder meeting earlier this month was AI. While he warned of deepfakes, the billionaire also believes it could be the “growth industry of all time.” It’s no secret the Oracle of…",
    "url": "https://biztoc.com/x/3ded05e66fa2d1a0",
    "published_at": "2024-05-09T14:14:09Z"
  },
  {
    "title": "Wall Street Thinks This Warren Buffett Stock Pick Has 27% Upside",
    "description": "When Warren Buffett and Berkshire Hathaway Inc. (NYSE: BRK-A) part with shares of Apple Inc. (NASDAQ: AAPL), the largest stake in the Berkshire portfolio, it makes headlines. Of course it does. The so-called Oracle of Omaha is probably the best-known investor…",
    "url": "https://biztoc.com/x/540c8c9a4e32651c",
    "published_at": "2024-05-09T14:14:08Z"
  },
  {
    "title": "Warren Buffett hromadí hotovost a prodal akcie Applu. Máme se obávat propadů na trzích?",
    "description": "Warren Buffett prodal více než sto milionů kusů akcií společnosti Apple a nahromadil rekordní sumu hotovosti. I takové informace přinesla konference investičního gigantu Berkshire Hathaway ze začátku května. Ta se letos poprvé odehrála bez zesnulého Charlieho…",
    "url": "https://archiv.hn.cz/c1-67321850-warren-buffett-hromadi-hotovost-a-prodal-akcie-applu-mame-se-obavat-propadu-na-trzich",
    "published_at": "2024-05-09T14:14:00Z"
  },
  {
    "title": "A Conversation With Warren Buffett On Philanthropy",
    "description": "Explore Warren Buffett's views on corporate philanthropy, his relationship with GLIDE and Marc Benioff's new role in the Power of One Charity Lunch Auctions.",
    "url": "https://www.forbes.com/sites/alexanderpuutio/2024/05/09/a-conversation-with-warren-buffett-on-philanthropy/",
    "published_at": "2024-05-09T13:55:00Z"
  },
  {
    "title": "Scrimping and saving to start your snowball rolling",
    "description": "It's snow joke. (Sorry!)\nThe post Scrimping and saving to start your snowball rolling appeared first on Monevator.",
    "url": "https://monevator.com/saving-snowball/",
    "published_at": "2024-05-09T10:25:44Z"
  },
  {
    "title": "Billionaire Bill Gates Has 51% of His Portfolio Invested in 2 Brilliant Stocks",
    "description": "The Bill and Melinda Gates (BMG) Foundation Trust had $42 billion invested across 24 stocks as of the fourth quarter, but 51% of that sum was concentrated in two positions: 34% in Microsoft (NASDAQ: MSFT) and 17% in Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK…",
    "url": "https://biztoc.com/x/79634f37959fc4fd",
    "published_at": "2024-05-09T09:44:04Z"
  },
  {
    "title": "Buffett: Η τεχνητή νοημοσύνη με τρομάζει όπως ο διάολος – Το τζίνι βγήκε από το μπουκάλι και απειλεί με όλεθρο",
    "description": "Αρνείται να πηδήξει στο τρένο της τεχνητής νοημοσύνης –τουλάχιστον δεν το παίρνει ακόμη– ο γνωστός επενδυτής και ιδρυτής της Berkshire Hathaway, Warren Buffett, καθώς, όπως επισημαίνει, πρόκειται για μη δοκιμασμένη τεχνολογία, που ακόμη δεν έχει παρουσιάσει δ…",
    "url": "https://i-epikaira.blogspot.com/2024/05/buffett.html",
    "published_at": "2024-05-09T09:13:00Z"
  },
  {
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "published_at": "1970-01-01T00:00:00Z"
  },
  {
    "title": "Apple Stock (NASDAQ:AAPL): 110-Billion Reasons to Buy after Buffett Sold - TipRanks.com",
    "description": "Apple (NASDAQ:AAPL) shocked Wall Street when it announced its massive $110 billion buyback plan (the largest of all time) alongside a generous dividend increase and a side of some better-than-expected quarterly results. Shares shot around 6% higher after the …",
    "url": "https://biztoc.com/x/e8e84576d8f1f2c3",
    "published_at": "2024-05-09T05:42:05Z"
  },
  {
    "title": "Europe's laggard stocks sparkle as superstars hit pause",
    "description": "(marketscreener.com) Investors have been lukewarm about the earnings of some of Europe's star performers, which suggests more neglected corners of the market are popping up on their radar screens, particularly as interest-rate cuts become more likely. \n Europ…",
    "url": "https://www.marketscreener.com/quote/stock/ASML-HOLDING-N-V-12002973/news/Europe-s-laggard-stocks-sparkle-as-superstars-hit-pause-46673110/",
    "published_at": "2024-05-09T05:03:43Z"
  },
  {
    "title": "Vorbereitet für Nach-Buffett-Ära: Die neue Zeit bei Berkshire hat bereits begonnen",
    "description": "Investorenlegende Warren Buffett hat auch mit 93 Jahren nicht die Absicht, sich zur Ruhe zu setzen. Dennoch hat bei seinem Konzern Berkshire Hathaway der Umbruch in eine neue Zeit bereits begonnen - nicht nur personell.",
    "url": "https://www.n-tv.de/wirtschaft/Die-neue-Zeit-bei-Berkshire-hat-bereits-begonnen-article24926446.html",
    "published_at": "2024-05-09T05:03:33Z"
  }
]